using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace ppp_dom_zad
{
    public class Map
    {
        public void Map_World()
        {
            Console.Clear();
            string l_1 = "\n\n\t\t __________________________________________\n" +
                        "\t\t||выход из леса|                           |\n" +
                        "\t\t|   |                                      |\n" +
                        "\t\t|   |       __________|темная роща|        |\n" +
                        "\t\t|    \\__ __/                               |\n" +
                        "\t\t|       |                                  |\n" +
                        "\t\t||река|_|_                                 |\n" +
                        "\t\t|         \\     |болото|_____|темная роща| |\n" +
                        "\t\t|          \\              /                |\n" +
                        "\t\t|           \\____________/                 |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|             {Бауэрстоун}                 |\n" +
                        "\t\t|__________________________________________|\n";
        }
        public void Quest_1_Map_World_goRosha()
        {
            Console.Clear();
            string l_1 = "\n\n\t\t __________________________________________\n" +
                        "\t\t||выход из леса|                           |\n" +
                        "\t\t|   |                                      |\n" +
                        "\t\t|   |       __________|темная роща|        |\n" +
                        "\t\t|    \\__ __/                               |\n" +
                        "\t\t|       |                                  |\n" +
                        "\t\t||река|_|_                                 |\n" +
                        "\t\t|         \\     |болото|_____|темная роща| |\n" +
                        "\t\t|          \\              /                |\n" +
                        "\t\t|           \\____________/                 |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|             {Бауэрстоун}                 |\n" +
                        "\t\t|__________________________________________|\n";
            string l_2 = "\n\n\t\t __________________________________________\n" +
                        "\t\t||выход из леса|                           |\n" +
                        "\t\t|   |                                      |\n" +
                        "\t\t|   |       __________|темная роща|        |\n" +
                        "\t\t|    \\__ __/                               |\n" +
                        "\t\t|       |                                  |\n" +
                        "\t\t||река|_|_                                 |\n" +
                        "\t\t|         \\     |болото|_____|темная роща| |\n" +
                        "\t\t|          \\              *                |\n" +
                        "\t\t|           \\____________/                 |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|             {Бауэрстоун}                 |\n" +
                        "\t\t|__________________________________________|\n";
            string l_3 = "\n\n\t\t __________________________________________\n" +
                        "\t\t||выход из леса|                           |\n" +
                        "\t\t|   |                                      |\n" +
                        "\t\t|   |       __________|темная роща|        |\n" +
                        "\t\t|    \\__ __/                               |\n" +
                        "\t\t|       |                                  |\n" +
                        "\t\t||река|_|_                                 |\n" +
                        "\t\t|         \\     |болото|_____|темная роща| |\n" +
                        "\t\t|          \\              /                |\n" +
                        "\t\t|           \\____________*                 |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|             {Бауэрстоун}                 |\n" +
                        "\t\t|__________________________________________|\n";
            string l_4 = "\n\n\t\t __________________________________________\n" +
                       "\t\t||выход из леса|                           |\n" +
                       "\t\t|   |                                      |\n" +
                       "\t\t|   |       __________|темная роща|        |\n" +
                       "\t\t|    \\__ __/                               |\n" +
                       "\t\t|       |                                  |\n" +
                       "\t\t||река|_|_                                 |\n" +
                       "\t\t|         \\     |болото|_____|темная роща| |\n" +
                       "\t\t|          \\              /                |\n" +
                       "\t\t|           \\___________*/                 |\n" +
                       "\t\t|                  |                       |\n" +
                       "\t\t|             {Бауэрстоун}                 |\n" +
                       "\t\t|__________________________________________|\n";
            string l_5 = "\n\n\t\t __________________________________________\n" +
                       "\t\t||выход из леса|                           |\n" +
                       "\t\t|   |                                      |\n" +
                       "\t\t|   |       __________|темная роща|        |\n" +
                       "\t\t|    \\__ __/                               |\n" +
                       "\t\t|       |                                  |\n" +
                       "\t\t||река|_|_                                 |\n" +
                       "\t\t|         \\     |болото|_____|темная роща| |\n" +
                       "\t\t|          \\              /                |\n" +
                       "\t\t|           \\__________*_/                 |\n" +
                       "\t\t|                  |                       |\n" +
                       "\t\t|             {Бауэрстоун}                 |\n" +
                       "\t\t|__________________________________________|\n";
            string l_6 = "\n\n\t\t __________________________________________\n" +
                       "\t\t||выход из леса|                           |\n" +
                       "\t\t|   |                                      |\n" +
                       "\t\t|   |       __________|темная роща|        |\n" +
                       "\t\t|    \\__ __/                               |\n" +
                       "\t\t|       |                                  |\n" +
                       "\t\t||река|_|_                                 |\n" +
                       "\t\t|         \\     |болото|_____|темная роща| |\n" +
                       "\t\t|          \\              /                |\n" +
                       "\t\t|           \\_________*__/                 |\n" +
                       "\t\t|                  |                       |\n" +
                       "\t\t|             {Бауэрстоун}                 |\n" +
                       "\t\t|__________________________________________|\n";
            string l_7 = "\n\n\t\t __________________________________________\n" +
                       "\t\t||выход из леса|                           |\n" +
                       "\t\t|   |                                      |\n" +
                       "\t\t|   |       __________|темная роща|        |\n" +
                       "\t\t|    \\__ __/                               |\n" +
                       "\t\t|       |                                  |\n" +
                       "\t\t||река|_|_                                 |\n" +
                       "\t\t|         \\     |болото|_____|темная роща| |\n" +
                       "\t\t|          \\              /                |\n" +
                       "\t\t|           \\________*___/                 |\n" +
                       "\t\t|                  |                       |\n" +
                       "\t\t|             {Бауэрстоун}                 |\n" +
                       "\t\t|__________________________________________|\n";
            string l_8 = "\n\n\t\t __________________________________________\n" +
                       "\t\t||выход из леса|                           |\n" +
                       "\t\t|   |                                      |\n" +
                       "\t\t|   |       __________|темная роща|        |\n" +
                       "\t\t|    \\__ __/                               |\n" +
                       "\t\t|       |                                  |\n" +
                       "\t\t||река|_|_                                 |\n" +
                       "\t\t|         \\     |болото|_____|темная роща| |\n" +
                       "\t\t|          \\              /                |\n" +
                       "\t\t|           \\_______*____/                 |\n" +
                       "\t\t|                  |                       |\n" +
                       "\t\t|             {Бауэрстоун}                 |\n" +
                       "\t\t|__________________________________________|\n";
            string l_9 = "\n\n\t\t __________________________________________\n" +
                      "\t\t||выход из леса|                           |\n" +
                      "\t\t|   |                                      |\n" +
                      "\t\t|   |       __________|темная роща|        |\n" +
                      "\t\t|    \\__ __/                               |\n" +
                      "\t\t|       |                                  |\n" +
                      "\t\t||река|_|_                                 |\n" +
                      "\t\t|         \\     |болото|_____|темная роща| |\n" +
                      "\t\t|          \\              /                |\n" +
                      "\t\t|           \\______*_____/                 |\n" +
                      "\t\t|                  |                       |\n" +
                      "\t\t|             {Бауэрстоун}                 |\n" +
                      "\t\t|__________________________________________|\n";
            string l_10 = "\n\n\t\t __________________________________________\n" +
                      "\t\t||выход из леса|                           |\n" +
                      "\t\t|   |                                      |\n" +
                      "\t\t|   |       __________|темная роща|        |\n" +
                      "\t\t|    \\__ __/                               |\n" +
                      "\t\t|       |                                  |\n" +
                      "\t\t||река|_|_                                 |\n" +
                      "\t\t|         \\     |болото|_____|темная роща| |\n" +
                      "\t\t|          \\              /                |\n" +
                      "\t\t|           \\____________/                 |\n" +
                      "\t\t|                  *                       |\n" +
                      "\t\t|             {Бауэрстоун}                 |\n" +
                      "\t\t|__________________________________________|\n";
            string l_11 = "\n\n\t\t __________________________________________\n" +
                      "\t\t||выход из леса|                           |\n" +
                      "\t\t|   |                                      |\n" +
                      "\t\t|   |       __________|темная роща|        |\n" +
                      "\t\t|    \\__ __/                               |\n" +
                      "\t\t|       |                                  |\n" +
                      "\t\t||река|_|_                                 |\n" +
                      "\t\t|         \\     |болото|_____|темная роща| |\n" +
                      "\t\t|          \\              /                |\n" +
                      "\t\t|           \\____________/                 |\n" +
                      "\t\t|                  |                       |\n" +
                      "\t\t|             {Бауэрстоун}                 |\n" +
                      "\t\t|__________________________________________|\n";
            for (int i = 0; i < 1; i++)
            {
                Console.Write(l_11);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_10);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_9);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_8);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_7);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_6);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_5);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_4);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_3);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_2);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_1);
                Thread.Sleep(500);
                Console.Clear();
            }
        }

        public void Bowerstone_map()
        {
            Console.Clear();
            string bs_map = "\n\n\t\t __________________________________________\n" +
                        "\t\t|            {Выход из города}             |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|{З.Ч.Б}____        |                      |\n" +
                        "\t\t|           \\_______|____|Таверна|         |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                        "\t\t|         |_____             \\             |\n" +
                        "\t\t|              \\_____________/             |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                        "\t\t|__________________________________________|\n";
            Console.Write(bs_map);
        }

        public void Bowerstone_map_go_ExitTown()
        {
            Console.Clear();
            string bs_go_exit1 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|            {Выход из города}             |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|{З.Ч.Б}____        |                      |\n" +
                        "\t\t|           \\_______|___*|Таверна|         |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                        "\t\t|         |_____             \\             |\n" +
                        "\t\t|              \\_____________/             |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                        "\t\t|__________________________________________|\n";
            string bs_go_exit2 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|            {Выход из города}             |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|{З.Ч.Б}____        |                      |\n" +
                        "\t\t|           \\_______|__*_|Таверна|         |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                        "\t\t|         |_____             \\             |\n" +
                        "\t\t|              \\_____________/             |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                        "\t\t|__________________________________________|\n";
            string bs_go_exit3 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|            {Выход из города}             |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|{З.Ч.Б}____        |                      |\n" +
                        "\t\t|           \\_______|_*__|Таверна|         |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                        "\t\t|         |_____             \\             |\n" +
                        "\t\t|              \\_____________/             |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                        "\t\t|__________________________________________|\n";
            string bs_go_exit4 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|            {Выход из города}             |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|{З.Ч.Б}____        |                      |\n" +
                        "\t\t|           \\_______|*___|Таверна|         |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                        "\t\t|         |_____             \\             |\n" +
                        "\t\t|              \\_____________/             |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                        "\t\t|__________________________________________|\n";
            string bs_go_exit5 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|            {Выход из города}             |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|{З.Ч.Б}____        |                      |\n" +
                        "\t\t|           \\_______*____|Таверна|         |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                        "\t\t|         |_____             \\             |\n" +
                        "\t\t|              \\_____________/             |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                        "\t\t|__________________________________________|\n";
            string bs_go_exit6 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|            {Выход из города}             |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|{З.Ч.Б}____        *                      |\n" +
                        "\t\t|           \\_______|____|Таверна|         |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                        "\t\t|         |_____             \\             |\n" +
                        "\t\t|              \\_____________/             |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                        "\t\t|__________________________________________|\n";
            string bs_go_exit7 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|            {Выход из города}             |\n" +
                        "\t\t|                   *                      |\n" +
                        "\t\t|{З.Ч.Б}____        |                      |\n" +
                        "\t\t|           \\_______|____|Таверна|         |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                        "\t\t|         |_____             \\             |\n" +
                        "\t\t|              \\_____________/             |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                        "\t\t|__________________________________________|\n";
            string bs_go_exit8 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|            {Выход из города}             |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|{З.Ч.Б}____        |                      |\n" +
                        "\t\t|           \\_______|____|Таверна|         |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                        "\t\t|         |_____             \\             |\n" +
                        "\t\t|              \\_____________/             |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                        "\t\t|__________________________________________|\n";
            for (int i = 0; i < 1; i++)
            {
                Console.Write(bs_go_exit1);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_go_exit2);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_go_exit3);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_go_exit4);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_go_exit5);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_go_exit6);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_go_exit7);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_go_exit8);
                Thread.Sleep(500);
                Console.Clear();

            }

        }
    }

        
}
