using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;


namespace ppp_dom_zad
{
    public class Map
    {
        public void Map_World()
        {
            Console.Clear();
            string l_1 = "\n\n\t\t __________________________________________\n" +
                        "\t\t||выход из леса|                           |\n" +
                        "\t\t|   |                                      |\n" +
                        "\t\t|   |       __________|темная роща|        |\n" +
                        "\t\t|    \\__ __/                               |\n" +
                        "\t\t|       |                                  |\n" +
                        "\t\t||река|_|_                                 |\n" +
                        "\t\t|         \\     |болото|_____|темная роща| |\n" +
                        "\t\t|          \\              /                |\n" +
                        "\t\t|           \\____________/                 |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|             {Бауэрстоун}                 |\n" +
                        "\t\t|__________________________________________|\n";
        }
        public void Bowerstone_map()
        {
            Console.Clear();
            string bs_map = "\n\n\t\t __________________________________________\n" +
                        "\t\t|            {Выход из города}             |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|{З.Ч.Б}____        |                      |\n" +
                        "\t\t|           \\_______|____|Таверна|         |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                        "\t\t|         |_____             \\             |\n" +
                        "\t\t|               \\_____________/            |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                        "\t\t|__________________________________________|\n";
            Console.Write(bs_map);
        }

        internal void Bowerstone_Schooll_Forest()
        {
            string l_1 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|                                          |\n" +
                        "\t\t|    _____          ____                   |\n" +
                        "\t\t|         \\            /          _____    |\n" +
                        "\t\t|          \\__________/          /         |\n" +
                        "\t\t|          /           \\        /          |\n" +
                        "\t\t||Школа|__/             \\______/           |\n" +
                        "\t\t|         \\                                |\n" +
                        "\t\t|          \\________                       |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|                     \\_____________       |\n" +
                        "\t\t|                                          |\n" +
                        "\t\t|__________________________________________|\n";
            Console.Write(l_1);
        }

        public void Bowerstone_map_go_ExitTown()
        {
            Console.Clear();
            string bs_go_exit1 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|            {Выход из города}             |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|{З.Ч.Б}____        |                      |\n" +
                        "\t\t|           \\_______|___*|Таверна|         |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                        "\t\t|         |_____             \\             |\n" +
                        "\t\t|              \\_____________/             |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                        "\t\t|__________________________________________|\n";
            string bs_go_exit2 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|            {Выход из города}             |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|{З.Ч.Б}____        |                      |\n" +
                        "\t\t|           \\_______|__*_|Таверна|         |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                        "\t\t|         |_____             \\             |\n" +
                        "\t\t|              \\_____________/             |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                        "\t\t|__________________________________________|\n";
            string bs_go_exit3 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|            {Выход из города}             |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|{З.Ч.Б}____        |                      |\n" +
                        "\t\t|           \\_______|_*__|Таверна|         |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                        "\t\t|         |_____             \\             |\n" +
                        "\t\t|              \\_____________/             |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                        "\t\t|__________________________________________|\n";
            string bs_go_exit4 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|            {Выход из города}             |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|{З.Ч.Б}____        |                      |\n" +
                        "\t\t|           \\_______|*___|Таверна|         |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                        "\t\t|         |_____             \\             |\n" +
                        "\t\t|              \\_____________/             |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                        "\t\t|__________________________________________|\n";
            string bs_go_exit5 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|            {Выход из города}             |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|{З.Ч.Б}____        |                      |\n" +
                        "\t\t|           \\_______*____|Таверна|         |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                        "\t\t|         |_____             \\             |\n" +
                        "\t\t|              \\_____________/             |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                        "\t\t|__________________________________________|\n";
            string bs_go_exit6 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|            {Выход из города}             |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|{З.Ч.Б}____        *                      |\n" +
                        "\t\t|           \\_______|____|Таверна|         |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                        "\t\t|         |_____             \\             |\n" +
                        "\t\t|              \\_____________/             |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                        "\t\t|__________________________________________|\n";
            string bs_go_exit7 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|            {Выход из города}             |\n" +
                        "\t\t|                   *                      |\n" +
                        "\t\t|{З.Ч.Б}____        |                      |\n" +
                        "\t\t|           \\_______|____|Таверна|         |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                        "\t\t|         |_____             \\             |\n" +
                        "\t\t|              \\_____________/             |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                        "\t\t|__________________________________________|\n";
            string bs_go_exit8 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|            {Выход из города}             |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|{З.Ч.Б}____        |                      |\n" +
                        "\t\t|           \\_______|____|Таверна|         |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                        "\t\t|         |_____             \\             |\n" +
                        "\t\t|              \\_____________/             |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                        "\t\t|__________________________________________|\n";
            for (int i = 0; i < 1; i++)
            {
                Console.Write(bs_go_exit1);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_go_exit2);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_go_exit3);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_go_exit4);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_go_exit5);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_go_exit6);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_go_exit7);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_go_exit8);
                Thread.Sleep(500);
                Console.Clear();

            }

        }

        public void Bowerstone_map_go_Shop()
        {
            Console.Clear();
            string bs_bazar1 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|            {Выход из города}             |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|{З.Ч.Б}____        |                      |\n" +
                        "\t\t|           \\_______|____|Таверна|         |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                        "\t\t|         |_____             \\             |\n" +
                        "\t\t|               \\_____________/            |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                        "\t\t|__________________________________________|\n";
            string bs_bazar2 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|            {Выход из города}             |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|{З.Ч.Б}____        |                      |\n" +
                        "\t\t|           \\_______|___*|Таверна|         |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                        "\t\t|         |_____             \\             |\n" +
                        "\t\t|               \\_____________/            |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                        "\t\t|__________________________________________|\n";
            string bs_bazar3 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|            {Выход из города}             |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|{З.Ч.Б}____        |                      |\n" +
                        "\t\t|           \\_______|__*_|Таверна|         |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                        "\t\t|         |_____             \\             |\n" +
                        "\t\t|               \\_____________/            |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                        "\t\t|__________________________________________|\n";
            string bs_bazar4 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|            {Выход из города}             |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|{З.Ч.Б}____        |                      |\n" +
                        "\t\t|           \\_______|_*__|Таверна|         |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                        "\t\t|         |_____             \\             |\n" +
                        "\t\t|               \\_____________/            |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                        "\t\t|__________________________________________|\n";
            string bs_bazar5 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|            {Выход из города}             |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|{З.Ч.Б}____        |                      |\n" +
                        "\t\t|           \\_______|*___|Таверна|         |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                        "\t\t|         |_____             \\             |\n" +
                        "\t\t|               \\_____________/            |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                        "\t\t|__________________________________________|\n";
            string bs_bazar6 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|            {Выход из города}             |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|{З.Ч.Б}____        |                      |\n" +
                        "\t\t|           \\_______*____|Таверна|         |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                        "\t\t|         |_____             \\             |\n" +
                        "\t\t|               \\_____________/            |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                        "\t\t|__________________________________________|\n";
            string bs_bazar7 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|            {Выход из города}             |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|{З.Ч.Б}____        |                      |\n" +
                        "\t\t|           \\_______|____|Таверна|         |\n" +
                        "\t\t|                   *                      |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                        "\t\t|         |_____             \\             |\n" +
                        "\t\t|               \\_____________/            |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                        "\t\t|__________________________________________|\n";
            string bs_bazar8 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|            {Выход из города}             |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|{З.Ч.Б}____        |                      |\n" +
                        "\t\t|           \\_______|____|Таверна|         |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|                    *                     |\n" +
                        "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                        "\t\t|         |_____             \\             |\n" +
                        "\t\t|               \\_____________/            |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                        "\t\t|__________________________________________|\n";
            string bs_bazar9 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|            {Выход из города}             |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|{З.Ч.Б}____        |                      |\n" +
                        "\t\t|           \\_______|____|Таверна|         |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|      |Рынок|        *_____|Школа-Инт|    |\n" +
                        "\t\t|         |_____             \\             |\n" +
                        "\t\t|               \\_____________/            |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                        "\t\t|__________________________________________|\n";
            string bs_bazar10 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|            {Выход из города}             |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|{З.Ч.Б}____        |                      |\n" +
                        "\t\t|           \\_______|____|Таверна|         |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|      |Рынок|        \\*____|Школа-Инт|    |\n" +
                        "\t\t|         |_____             \\             |\n" +
                        "\t\t|               \\_____________/            |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                        "\t\t|__________________________________________|\n";
            string bs_bazar11 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|            {Выход из города}             |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|{З.Ч.Б}____        |                      |\n" +
                        "\t\t|           \\_______|____|Таверна|         |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|      |Рынок|        \\_*___|Школа-Инт|    |\n" +
                        "\t\t|         |_____             \\             |\n" +
                        "\t\t|               \\_____________/            |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                        "\t\t|__________________________________________|\n";
            string bs_bazar12 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|            {Выход из города}             |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|{З.Ч.Б}____        |                      |\n" +
                        "\t\t|           \\_______|____|Таверна|         |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|      |Рынок|        \\__*__|Школа-Инт|    |\n" +
                        "\t\t|         |_____             \\             |\n" +
                        "\t\t|               \\_____________/            |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                        "\t\t|__________________________________________|\n";
            string bs_bazar13 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|            {Выход из города}             |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|{З.Ч.Б}____        |                      |\n" +
                        "\t\t|           \\_______|____|Таверна|         |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|      |Рынок|        \\___*_|Школа-Инт|    |\n" +
                        "\t\t|         |_____             \\             |\n" +
                        "\t\t|               \\_____________/            |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                        "\t\t|__________________________________________|\n";
            string bs_bazar14 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|            {Выход из города}             |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|{З.Ч.Б}____        |                      |\n" +
                        "\t\t|           \\_______|____|Таверна|         |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|      |Рынок|        \\____*|Школа-Инт|    |\n" +
                        "\t\t|         |_____             \\             |\n" +
                        "\t\t|               \\_____________/            |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                        "\t\t|__________________________________________|\n";
            string bs_bazar15 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|            {Выход из города}             |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|{З.Ч.Б}____        |                      |\n" +
                        "\t\t|           \\_______|____|Таверна|         |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                        "\t\t|         |_____             *             |\n" +
                        "\t\t|               \\_____________/            |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                        "\t\t|__________________________________________|\n";
            string bs_bazar16 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|            {Выход из города}             |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|{З.Ч.Б}____        |                      |\n" +
                        "\t\t|           \\_______|____|Таверна|         |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                        "\t\t|         |_____             \\             |\n" +
                        "\t\t|               \\_____________*            |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                        "\t\t|__________________________________________|\n";
            string bs_bazar17 = "\n\n\t\t __________________________________________\n" +
                       "\t\t|            {Выход из города}             |\n" +
                       "\t\t|                   |                      |\n" +
                       "\t\t|{З.Ч.Б}____        |                      |\n" +
                       "\t\t|           \\_______|____|Таверна|         |\n" +
                       "\t\t|                   |                      |\n" +
                       "\t\t|                    \\                     |\n" +
                       "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                       "\t\t|         |_____             \\             |\n" +
                       "\t\t|               \\____________*/            |\n" +
                       "\t\t|                  |                       |\n" +
                       "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                       "\t\t|__________________________________________|\n";
            string bs_bazar18 = "\n\n\t\t __________________________________________\n" +
                       "\t\t|            {Выход из города}             |\n" +
                       "\t\t|                   |                      |\n" +
                       "\t\t|{З.Ч.Б}____        |                      |\n" +
                       "\t\t|           \\_______|____|Таверна|         |\n" +
                       "\t\t|                   |                      |\n" +
                       "\t\t|                    \\                     |\n" +
                       "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                       "\t\t|         |_____             \\             |\n" +
                       "\t\t|               \\___________*_/            |\n" +
                       "\t\t|                  |                       |\n" +
                       "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                       "\t\t|__________________________________________|\n";
            string bs_bazar19 = "\n\n\t\t __________________________________________\n" +
                       "\t\t|            {Выход из города}             |\n" +
                       "\t\t|                   |                      |\n" +
                       "\t\t|{З.Ч.Б}____        |                      |\n" +
                       "\t\t|           \\_______|____|Таверна|         |\n" +
                       "\t\t|                   |                      |\n" +
                       "\t\t|                    \\                     |\n" +
                       "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                       "\t\t|         |_____             \\             |\n" +
                       "\t\t|               \\__________*__/            |\n" +
                       "\t\t|                  |                       |\n" +
                       "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                       "\t\t|__________________________________________|\n";
            string bs_bazar20 = "\n\n\t\t __________________________________________\n" +
                       "\t\t|            {Выход из города}             |\n" +
                       "\t\t|                   |                      |\n" +
                       "\t\t|{З.Ч.Б}____        |                      |\n" +
                       "\t\t|           \\_______|____|Таверна|         |\n" +
                       "\t\t|                   |                      |\n" +
                       "\t\t|                    \\                     |\n" +
                       "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                       "\t\t|         |_____             \\             |\n" +
                       "\t\t|               \\_________*___/            |\n" +
                       "\t\t|                  |                       |\n" +
                       "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                       "\t\t|__________________________________________|\n";
            string bs_bazar21 = "\n\n\t\t __________________________________________\n" +
                       "\t\t|            {Выход из города}             |\n" +
                       "\t\t|                   |                      |\n" +
                       "\t\t|{З.Ч.Б}____        |                      |\n" +
                       "\t\t|           \\_______|____|Таверна|         |\n" +
                       "\t\t|                   |                      |\n" +
                       "\t\t|                    \\                     |\n" +
                       "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                       "\t\t|         |_____             \\             |\n" +
                       "\t\t|               \\________*____/            |\n" +
                       "\t\t|                  |                       |\n" +
                       "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                       "\t\t|__________________________________________|\n";
            string bs_bazar22 = "\n\n\t\t __________________________________________\n" +
                       "\t\t|            {Выход из города}             |\n" +
                       "\t\t|                   |                      |\n" +
                       "\t\t|{З.Ч.Б}____        |                      |\n" +
                       "\t\t|           \\_______|____|Таверна|         |\n" +
                       "\t\t|                   |                      |\n" +
                       "\t\t|                    \\                     |\n" +
                       "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                       "\t\t|         |_____             \\             |\n" +
                       "\t\t|               \\_______*_____/            |\n" +
                       "\t\t|                  |                       |\n" +
                       "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                       "\t\t|__________________________________________|\n";
            string bs_bazar23 = "\n\n\t\t __________________________________________\n" +
                       "\t\t|            {Выход из города}             |\n" +
                       "\t\t|                   |                      |\n" +
                       "\t\t|{З.Ч.Б}____        |                      |\n" +
                       "\t\t|           \\_______|____|Таверна|         |\n" +
                       "\t\t|                   |                      |\n" +
                       "\t\t|                    \\                     |\n" +
                       "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                       "\t\t|         |_____             \\             |\n" +
                       "\t\t|               \\______*______/            |\n" +
                       "\t\t|                  |                       |\n" +
                       "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                       "\t\t|__________________________________________|\n";
            string bs_bazar24 = "\n\n\t\t __________________________________________\n" +
                       "\t\t|            {Выход из города}             |\n" +
                       "\t\t|                   |                      |\n" +
                       "\t\t|{З.Ч.Б}____        |                      |\n" +
                       "\t\t|           \\_______|____|Таверна|         |\n" +
                       "\t\t|                   |                      |\n" +
                       "\t\t|                    \\                     |\n" +
                       "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                       "\t\t|         |_____             \\             |\n" +
                       "\t\t|               \\_____*_______/            |\n" +
                       "\t\t|                  |                       |\n" +
                       "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                       "\t\t|__________________________________________|\n";
            string bs_bazar25 = "\n\n\t\t __________________________________________\n" +
                       "\t\t|            {Выход из города}             |\n" +
                       "\t\t|                   |                      |\n" +
                       "\t\t|{З.Ч.Б}____        |                      |\n" +
                       "\t\t|           \\_______|____|Таверна|         |\n" +
                       "\t\t|                   |                      |\n" +
                       "\t\t|                    \\                     |\n" +
                       "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                       "\t\t|         |_____             \\             |\n" +
                       "\t\t|               \\____*________/            |\n" +
                       "\t\t|                  |                       |\n" +
                       "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                       "\t\t|__________________________________________|\n";
            string bs_bazar26 = "\n\n\t\t __________________________________________\n" +
                       "\t\t|            {Выход из города}             |\n" +
                       "\t\t|                   |                      |\n" +
                       "\t\t|{З.Ч.Б}____        |                      |\n" +
                       "\t\t|           \\_______|____|Таверна|         |\n" +
                       "\t\t|                   |                      |\n" +
                       "\t\t|                    \\                     |\n" +
                       "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                       "\t\t|         |_____             \\             |\n" +
                       "\t\t|               \\___*_________/            |\n" +
                       "\t\t|                  |                       |\n" +
                       "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                       "\t\t|__________________________________________|\n";
            string bs_bazar27 = "\n\n\t\t __________________________________________\n" +
                       "\t\t|            {Выход из города}             |\n" +
                       "\t\t|                   |                      |\n" +
                       "\t\t|{З.Ч.Б}____        |                      |\n" +
                       "\t\t|           \\_______|____|Таверна|         |\n" +
                       "\t\t|                   |                      |\n" +
                       "\t\t|                    \\                     |\n" +
                       "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                       "\t\t|         |_____             \\             |\n" +
                       "\t\t|               \\__*__________/            |\n" +
                       "\t\t|                  |                       |\n" +
                       "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                       "\t\t|__________________________________________|\n";
            string bs_bazar28 = "\n\n\t\t __________________________________________\n" +
                       "\t\t|            {Выход из города}             |\n" +
                       "\t\t|                   |                      |\n" +
                       "\t\t|{З.Ч.Б}____        |                      |\n" +
                       "\t\t|           \\_______|____|Таверна|         |\n" +
                       "\t\t|                   |                      |\n" +
                       "\t\t|                    \\                     |\n" +
                       "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                       "\t\t|         |_____             \\             |\n" +
                       "\t\t|               \\_*___________/            |\n" +
                       "\t\t|                  |                       |\n" +
                       "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                       "\t\t|__________________________________________|\n";
            string bs_bazar29 = "\n\n\t\t __________________________________________\n" +
                       "\t\t|            {Выход из города}             |\n" +
                       "\t\t|                   |                      |\n" +
                       "\t\t|{З.Ч.Б}____        |                      |\n" +
                       "\t\t|           \\_______|____|Таверна|         |\n" +
                       "\t\t|                   |                      |\n" +
                       "\t\t|                    \\                     |\n" +
                       "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                       "\t\t|         |_____             \\             |\n" +
                       "\t\t|               \\*____________/            |\n" +
                       "\t\t|                  |                       |\n" +
                       "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                       "\t\t|__________________________________________|\n";
            string bs_bazar30 = "\n\n\t\t __________________________________________\n" +
                       "\t\t|            {Выход из города}             |\n" +
                       "\t\t|                   |                      |\n" +
                       "\t\t|{З.Ч.Б}____        |                      |\n" +
                       "\t\t|           \\_______|____|Таверна|         |\n" +
                       "\t\t|                   |                      |\n" +
                       "\t\t|                    \\                     |\n" +
                       "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                       "\t\t|         |_____             \\             |\n" +
                       "\t\t|              *_____________/             |\n" +
                       "\t\t|                  |                       |\n" +
                       "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                       "\t\t|__________________________________________|\n";
            string bs_bazar31 = "\n\n\t\t __________________________________________\n" +
                       "\t\t|            {Выход из города}             |\n" +
                       "\t\t|                   |                      |\n" +
                       "\t\t|{З.Ч.Б}____        |                      |\n" +
                       "\t\t|           \\_______|____|Таверна|         |\n" +
                       "\t\t|                   |                      |\n" +
                       "\t\t|                    \\                     |\n" +
                       "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                       "\t\t|         |____*             \\             |\n" +
                       "\t\t|               \\_____________/            |\n" +
                       "\t\t|                  |                       |\n" +
                       "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                       "\t\t|__________________________________________|\n";
            string bs_bazar32 = "\n\n\t\t __________________________________________\n" +
                       "\t\t|            {Выход из города}             |\n" +
                       "\t\t|                   |                      |\n" +
                       "\t\t|{З.Ч.Б}____        |                      |\n" +
                       "\t\t|           \\_______|____|Таверна|         |\n" +
                       "\t\t|                   |                      |\n" +
                       "\t\t|                    \\                     |\n" +
                       "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                       "\t\t|         |___*_             \\             |\n" +
                       "\t\t|               \\_____________/            |\n" +
                       "\t\t|                  |                       |\n" +
                       "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                       "\t\t|__________________________________________|\n";
            string bs_bazar33 = "\n\n\t\t __________________________________________\n" +
                       "\t\t|            {Выход из города}             |\n" +
                       "\t\t|                   |                      |\n" +
                       "\t\t|{З.Ч.Б}____        |                      |\n" +
                       "\t\t|           \\_______|____|Таверна|         |\n" +
                       "\t\t|                   |                      |\n" +
                       "\t\t|                    \\                     |\n" +
                       "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                       "\t\t|         |__*__             \\             |\n" +
                       "\t\t|               \\_____________/            |\n" +
                       "\t\t|                  |                       |\n" +
                       "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                       "\t\t|__________________________________________|\n";
            string bs_bazar34 = "\n\n\t\t __________________________________________\n" +
                       "\t\t|            {Выход из города}             |\n" +
                       "\t\t|                   |                      |\n" +
                       "\t\t|{З.Ч.Б}____        |                      |\n" +
                       "\t\t|           \\_______|____|Таверна|         |\n" +
                       "\t\t|                   |                      |\n" +
                       "\t\t|                    \\                     |\n" +
                       "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                       "\t\t|         |_*___             \\             |\n" +
                       "\t\t|               \\_____________/            |\n" +
                       "\t\t|                  |                       |\n" +
                       "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                       "\t\t|__________________________________________|\n";
            string bs_bazar35 = "\n\n\t\t __________________________________________\n" +
                       "\t\t|            {Выход из города}             |\n" +
                       "\t\t|                   |                      |\n" +
                       "\t\t|{З.Ч.Б}____        |                      |\n" +
                       "\t\t|           \\_______|____|Таверна|         |\n" +
                       "\t\t|                   |                      |\n" +
                       "\t\t|                    \\                     |\n" +
                       "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                       "\t\t|         |*____             \\             |\n" +
                       "\t\t|               \\_____________/            |\n" +
                       "\t\t|                  |                       |\n" +
                       "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                       "\t\t|__________________________________________|\n";
            string bs_bazar36 = "\n\n\t\t __________________________________________\n" +
                       "\t\t|            {Выход из города}             |\n" +
                       "\t\t|                   |                      |\n" +
                       "\t\t|{З.Ч.Б}____        |                      |\n" +
                       "\t\t|           \\_______|____|Таверна|         |\n" +
                       "\t\t|                   |                      |\n" +
                       "\t\t|                    \\                     |\n" +
                       "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                       "\t\t|         *____             \\              |\n" +
                       "\t\t|               \\_____________/            |\n" +
                       "\t\t|                  |                       |\n" +
                       "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                       "\t\t|__________________________________________|\n";
            string bs_bazar37 = "\n\n\t\t __________________________________________\n" +
                       "\t\t|            {Выход из города}             |\n" +
                       "\t\t|                   |                      |\n" +
                       "\t\t|{З.Ч.Б}____        |                      |\n" +
                       "\t\t|           \\_______|____|Таверна|         |\n" +
                       "\t\t|                   |                      |\n" +
                       "\t\t|                    \\                     |\n" +
                       "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                       "\t\t|         |____             \\              |\n" +
                       "\t\t|               \\_____________/            |\n" +
                       "\t\t|                  |                       |\n" +
                       "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                       "\t\t|__________________________________________|\n";
            for (int i = 0; i < 1; i++)
            {
                Console.Write(bs_bazar1);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_bazar2);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_bazar3);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_bazar4);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_bazar5);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_bazar6);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_bazar7);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_bazar8);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_bazar9);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_bazar10);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_bazar11);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_bazar12);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_bazar13);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_bazar14);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_bazar15);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_bazar16);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_bazar17);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_bazar18);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_bazar19);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_bazar20);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_bazar21);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_bazar22);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_bazar23);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_bazar24);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_bazar25);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_bazar26);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_bazar27);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_bazar28);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_bazar29);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_bazar30);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_bazar31);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_bazar32);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_bazar33);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_bazar34);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_bazar35);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_bazar36);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_bazar37);
                Thread.Sleep(500);
                Console.Clear();

            }
        }

        public void Bowerstone_map_go_Schooll()
        {
            Console.Clear();
            string bs_bazar1 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|            {Выход из города}             |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|{З.Ч.Б}____        |                      |\n" +
                        "\t\t|           \\_______|____|Таверна|         |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                        "\t\t|         |_____             \\             |\n" +
                        "\t\t|               \\_____________/            |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                        "\t\t|__________________________________________|\n";
            string bs_bazar2 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|            {Выход из города}             |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|{З.Ч.Б}____        |                      |\n" +
                        "\t\t|           \\_______|___*|Таверна|         |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                        "\t\t|         |_____             \\             |\n" +
                        "\t\t|               \\_____________/            |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                        "\t\t|__________________________________________|\n";
            string bs_bazar3 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|            {Выход из города}             |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|{З.Ч.Б}____        |                      |\n" +
                        "\t\t|           \\_______|__*_|Таверна|         |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                        "\t\t|         |_____             \\             |\n" +
                        "\t\t|               \\_____________/            |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                        "\t\t|__________________________________________|\n";
            string bs_bazar4 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|            {Выход из города}             |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|{З.Ч.Б}____        |                      |\n" +
                        "\t\t|           \\_______|_*__|Таверна|         |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                        "\t\t|         |_____             \\             |\n" +
                        "\t\t|               \\_____________/            |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                        "\t\t|__________________________________________|\n";
            string bs_bazar5 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|            {Выход из города}             |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|{З.Ч.Б}____        |                      |\n" +
                        "\t\t|           \\_______|*___|Таверна|         |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                        "\t\t|         |_____             \\             |\n" +
                        "\t\t|               \\_____________/            |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                        "\t\t|__________________________________________|\n";
            string bs_bazar6 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|            {Выход из города}             |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|{З.Ч.Б}____        |                      |\n" +
                        "\t\t|           \\_______*____|Таверна|         |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                        "\t\t|         |_____             \\             |\n" +
                        "\t\t|               \\_____________/            |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                        "\t\t|__________________________________________|\n";
            string bs_bazar7 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|            {Выход из города}             |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|{З.Ч.Б}____        |                      |\n" +
                        "\t\t|           \\_______|____|Таверна|         |\n" +
                        "\t\t|                   *                      |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                        "\t\t|         |_____             \\             |\n" +
                        "\t\t|               \\_____________/            |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                        "\t\t|__________________________________________|\n";
            string bs_bazar8 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|            {Выход из города}             |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|{З.Ч.Б}____        |                      |\n" +
                        "\t\t|           \\_______|____|Таверна|         |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|                    *                     |\n" +
                        "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                        "\t\t|         |_____             \\             |\n" +
                        "\t\t|               \\_____________/            |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                        "\t\t|__________________________________________|\n";
            string bs_bazar9 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|            {Выход из города}             |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|{З.Ч.Б}____        |                      |\n" +
                        "\t\t|           \\_______|____|Таверна|         |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|      |Рынок|        *_____|Школа-Инт|    |\n" +
                        "\t\t|         |_____             \\             |\n" +
                        "\t\t|               \\_____________/            |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                        "\t\t|__________________________________________|\n";
            string bs_bazar10 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|            {Выход из города}             |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|{З.Ч.Б}____        |                      |\n" +
                        "\t\t|           \\_______|____|Таверна|         |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|      |Рынок|        \\*____|Школа-Инт|    |\n" +
                        "\t\t|         |_____             \\             |\n" +
                        "\t\t|               \\_____________/            |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                        "\t\t|__________________________________________|\n";
            string bs_bazar11 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|            {Выход из города}             |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|{З.Ч.Б}____        |                      |\n" +
                        "\t\t|           \\_______|____|Таверна|         |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|      |Рынок|        \\_*___|Школа-Инт|    |\n" +
                        "\t\t|         |_____             \\             |\n" +
                        "\t\t|               \\_____________/            |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                        "\t\t|__________________________________________|\n";
            string bs_bazar12 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|            {Выход из города}             |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|{З.Ч.Б}____        |                      |\n" +
                        "\t\t|           \\_______|____|Таверна|         |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|      |Рынок|        \\__*__|Школа-Инт|    |\n" +
                        "\t\t|         |_____             \\             |\n" +
                        "\t\t|               \\_____________/            |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                        "\t\t|__________________________________________|\n";
            string bs_bazar13 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|            {Выход из города}             |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|{З.Ч.Б}____        |                      |\n" +
                        "\t\t|           \\_______|____|Таверна|         |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|      |Рынок|        \\___*_|Школа-Инт|    |\n" +
                        "\t\t|         |_____             \\             |\n" +
                        "\t\t|               \\_____________/            |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                        "\t\t|__________________________________________|\n";
            string bs_bazar14 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|            {Выход из города}             |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|{З.Ч.Б}____        |                      |\n" +
                        "\t\t|           \\_______|____|Таверна|         |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|      |Рынок|        \\____*|Школа-Инт|    |\n" +
                        "\t\t|         |_____             \\             |\n" +
                        "\t\t|               \\_____________/            |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                        "\t\t|__________________________________________|\n";
            string bs_bazar15 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|            {Выход из города}             |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|{З.Ч.Б}____        |                      |\n" +
                        "\t\t|           \\_______|____|Таверна|         |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                        "\t\t|         |_____             \\             |\n" +
                        "\t\t|               \\_____________/            |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                        "\t\t|__________________________________________|\n";
            for (int i = 0; i < 1; i++)
            {
                Console.Write(bs_bazar1);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_bazar2);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_bazar3);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_bazar4);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_bazar5);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_bazar6);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_bazar7);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_bazar8);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_bazar9);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_bazar10);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_bazar11);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_bazar12);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_bazar13);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_bazar14);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_bazar15);
                Thread.Sleep(500);
                Console.Clear();
            }
        }

        public void Bowerstone_map_go_ZCB()
        {
            Console.Clear();
            string bs_go_exit1 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|            {Выход из города}             |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|{З.Ч.Б}____        |                      |\n" +
                        "\t\t|           \\_______|___*|Таверна|         |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                        "\t\t|         |_____             \\             |\n" +
                        "\t\t|              \\_____________/             |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                        "\t\t|__________________________________________|\n";
            string bs_go_exit2 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|            {Выход из города}             |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|{З.Ч.Б}____        |                      |\n" +
                        "\t\t|           \\_______|__*_|Таверна|         |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                        "\t\t|         |_____             \\             |\n" +
                        "\t\t|              \\_____________/             |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                        "\t\t|__________________________________________|\n";
            string bs_go_exit3 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|            {Выход из города}             |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|{З.Ч.Б}____        |                      |\n" +
                        "\t\t|           \\_______|_*__|Таверна|         |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                        "\t\t|         |_____             \\             |\n" +
                        "\t\t|              \\_____________/             |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                        "\t\t|__________________________________________|\n";
            string bs_go_exit4 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|            {Выход из города}             |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|{З.Ч.Б}____        |                      |\n" +
                        "\t\t|           \\_______|*___|Таверна|         |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                        "\t\t|         |_____             \\             |\n" +
                        "\t\t|              \\_____________/             |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                        "\t\t|__________________________________________|\n";
            string bs_go_exit5 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|            {Выход из города}             |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|{З.Ч.Б}____        |                      |\n" +
                        "\t\t|           \\_______*____|Таверна|         |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                        "\t\t|         |_____             \\             |\n" +
                        "\t\t|              \\_____________/             |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                        "\t\t|__________________________________________|\n";
            string bs_go_exit6 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|            {Выход из города}             |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|{З.Ч.Б}____        |                      |\n" +
                        "\t\t|           \\______*|____|Таверна|         |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                        "\t\t|         |_____             \\             |\n" +
                        "\t\t|              \\_____________/             |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                        "\t\t|__________________________________________|\n";
            string bs_go_exit7 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|            {Выход из города}             |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|{З.Ч.Б}____        |                      |\n" +
                        "\t\t|           \\_____*_|____|Таверна|         |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                        "\t\t|         |_____             \\             |\n" +
                        "\t\t|              \\_____________/             |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                        "\t\t|__________________________________________|\n";
            string bs_go_exit8 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|            {Выход из города}             |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|{З.Ч.Б}____        |                      |\n" +
                        "\t\t|           \\____*__|____|Таверна|         |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                        "\t\t|         |_____             \\             |\n" +
                        "\t\t|              \\_____________/             |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                        "\t\t|__________________________________________|\n";
            string bs_go_exit9 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|            {Выход из города}             |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|{З.Ч.Б}____        |                      |\n" +
                        "\t\t|           \\___*___|____|Таверна|         |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                        "\t\t|         |_____             \\             |\n" +
                        "\t\t|              \\_____________/             |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                        "\t\t|__________________________________________|\n";
            string bs_go_exit10 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|            {Выход из города}             |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|{З.Ч.Б}____        |                      |\n" +
                        "\t\t|           \\__*____|____|Таверна|         |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                        "\t\t|         |_____             \\             |\n" +
                        "\t\t|              \\_____________/             |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                        "\t\t|__________________________________________|\n";
            string bs_go_exit11 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|            {Выход из города}             |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|{З.Ч.Б}____        |                      |\n" +
                        "\t\t|           \\_*_____|____|Таверна|         |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                        "\t\t|         |_____             \\             |\n" +
                        "\t\t|              \\_____________/             |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                        "\t\t|__________________________________________|\n";
            string bs_go_exit12 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|            {Выход из города}             |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|{З.Ч.Б}____        |                      |\n" +
                        "\t\t|           \\*______|____|Таверна|         |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                        "\t\t|         |_____             \\             |\n" +
                        "\t\t|              \\_____________/             |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                        "\t\t|__________________________________________|\n";
            string bs_go_exit13 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|            {Выход из города}             |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|{З.Ч.Б}____        |                      |\n" +
                        "\t\t|           *_______|____|Таверна|         |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                        "\t\t|         |_____             \\             |\n" +
                        "\t\t|              \\_____________/             |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                        "\t\t|__________________________________________|\n";
            string bs_go_exit14 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|            {Выход из города}             |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|{З.Ч.Б}___*        |                      |\n" +
                        "\t\t|           \\_______|____|Таверна|         |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                        "\t\t|         |_____             \\             |\n" +
                        "\t\t|              \\_____________/             |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                        "\t\t|__________________________________________|\n";
            string bs_go_exit15 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|            {Выход из города}             |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|{З.Ч.Б}__*_        |                      |\n" +
                        "\t\t|           \\_______|____|Таверна|         |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                        "\t\t|         |_____             \\             |\n" +
                        "\t\t|              \\_____________/             |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                        "\t\t|__________________________________________|\n";
            string bs_go_exit16 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|            {Выход из города}             |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|{З.Ч.Б}_*__        |                      |\n" +
                        "\t\t|           \\_______|____|Таверна|         |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                        "\t\t|         |_____             \\             |\n" +
                        "\t\t|              \\_____________/             |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                        "\t\t|__________________________________________|\n";
            string bs_go_exit17 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|            {Выход из города}             |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|{З.Ч.Б}*___        |                      |\n" +
                        "\t\t|           \\_______|____|Таверна|         |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                        "\t\t|         |_____             \\             |\n" +
                        "\t\t|              \\_____________/             |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                        "\t\t|__________________________________________|\n";
            string bs_go_exit18 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|            {Выход из города}             |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|{З.Ч.Б}____        |                      |\n" +
                        "\t\t|           \\_______|____|Таверна|         |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                        "\t\t|         |_____             \\             |\n" +
                        "\t\t|              \\_____________/             |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                        "\t\t|__________________________________________|\n";

            for (int i = 0; i < 1; i++)
            {
                Console.Write(bs_go_exit1);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_go_exit2);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_go_exit3);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_go_exit4);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_go_exit5);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_go_exit6);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_go_exit7);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_go_exit8);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_go_exit9);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_go_exit10);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_go_exit11);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_go_exit12);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_go_exit13);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_go_exit14);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_go_exit15);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_go_exit16);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_go_exit17);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_go_exit18);
                Thread.Sleep(500);
                Console.Clear();


            }
        }

        public void Bowerstone_map_go_SouthBowerstone()
        {
            Console.Clear();
            string bs_bazar1 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|            {Выход из города}             |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|{З.Ч.Б}____        |                      |\n" +
                        "\t\t|           \\_______|____|Таверна|         |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                        "\t\t|         |_____             \\             |\n" +
                        "\t\t|               \\_____________/            |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                        "\t\t|__________________________________________|\n";
            string bs_bazar2 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|            {Выход из города}             |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|{З.Ч.Б}____        |                      |\n" +
                        "\t\t|           \\_______|___*|Таверна|         |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                        "\t\t|         |_____             \\             |\n" +
                        "\t\t|               \\_____________/            |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                        "\t\t|__________________________________________|\n";
            string bs_bazar3 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|            {Выход из города}             |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|{З.Ч.Б}____        |                      |\n" +
                        "\t\t|           \\_______|__*_|Таверна|         |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                        "\t\t|         |_____             \\             |\n" +
                        "\t\t|               \\_____________/            |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                        "\t\t|__________________________________________|\n";
            string bs_bazar4 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|            {Выход из города}             |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|{З.Ч.Б}____        |                      |\n" +
                        "\t\t|           \\_______|_*__|Таверна|         |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                        "\t\t|         |_____             \\             |\n" +
                        "\t\t|               \\_____________/            |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                        "\t\t|__________________________________________|\n";
            string bs_bazar5 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|            {Выход из города}             |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|{З.Ч.Б}____        |                      |\n" +
                        "\t\t|           \\_______|*___|Таверна|         |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                        "\t\t|         |_____             \\             |\n" +
                        "\t\t|               \\_____________/            |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                        "\t\t|__________________________________________|\n";
            string bs_bazar6 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|            {Выход из города}             |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|{З.Ч.Б}____        |                      |\n" +
                        "\t\t|           \\_______*____|Таверна|         |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                        "\t\t|         |_____             \\             |\n" +
                        "\t\t|               \\_____________/            |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                        "\t\t|__________________________________________|\n";
            string bs_bazar7 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|            {Выход из города}             |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|{З.Ч.Б}____        |                      |\n" +
                        "\t\t|           \\_______|____|Таверна|         |\n" +
                        "\t\t|                   *                      |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                        "\t\t|         |_____             \\             |\n" +
                        "\t\t|               \\_____________/            |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                        "\t\t|__________________________________________|\n";
            string bs_bazar8 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|            {Выход из города}             |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|{З.Ч.Б}____        |                      |\n" +
                        "\t\t|           \\_______|____|Таверна|         |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|                    *                     |\n" +
                        "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                        "\t\t|         |_____             \\             |\n" +
                        "\t\t|               \\_____________/            |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                        "\t\t|__________________________________________|\n";
            string bs_bazar9 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|            {Выход из города}             |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|{З.Ч.Б}____        |                      |\n" +
                        "\t\t|           \\_______|____|Таверна|         |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|      |Рынок|        *_____|Школа-Инт|    |\n" +
                        "\t\t|         |_____             \\             |\n" +
                        "\t\t|               \\_____________/            |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                        "\t\t|__________________________________________|\n";
            string bs_bazar10 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|            {Выход из города}             |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|{З.Ч.Б}____        |                      |\n" +
                        "\t\t|           \\_______|____|Таверна|         |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|      |Рынок|        \\*____|Школа-Инт|    |\n" +
                        "\t\t|         |_____             \\             |\n" +
                        "\t\t|               \\_____________/            |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                        "\t\t|__________________________________________|\n";
            string bs_bazar11 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|            {Выход из города}             |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|{З.Ч.Б}____        |                      |\n" +
                        "\t\t|           \\_______|____|Таверна|         |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|      |Рынок|        \\_*___|Школа-Инт|    |\n" +
                        "\t\t|         |_____             \\             |\n" +
                        "\t\t|               \\_____________/            |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                        "\t\t|__________________________________________|\n";
            string bs_bazar12 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|            {Выход из города}             |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|{З.Ч.Б}____        |                      |\n" +
                        "\t\t|           \\_______|____|Таверна|         |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|      |Рынок|        \\__*__|Школа-Инт|    |\n" +
                        "\t\t|         |_____             \\             |\n" +
                        "\t\t|               \\_____________/            |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                        "\t\t|__________________________________________|\n";
            string bs_bazar13 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|            {Выход из города}             |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|{З.Ч.Б}____        |                      |\n" +
                        "\t\t|           \\_______|____|Таверна|         |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|      |Рынок|        \\___*_|Школа-Инт|    |\n" +
                        "\t\t|         |_____             \\             |\n" +
                        "\t\t|               \\_____________/            |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                        "\t\t|__________________________________________|\n";
            string bs_bazar14 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|            {Выход из города}             |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|{З.Ч.Б}____        |                      |\n" +
                        "\t\t|           \\_______|____|Таверна|         |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|      |Рынок|        \\____*|Школа-Инт|    |\n" +
                        "\t\t|         |_____             \\             |\n" +
                        "\t\t|               \\_____________/            |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                        "\t\t|__________________________________________|\n";
            string bs_bazar15 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|            {Выход из города}             |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|{З.Ч.Б}____        |                      |\n" +
                        "\t\t|           \\_______|____|Таверна|         |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                        "\t\t|         |_____             *             |\n" +
                        "\t\t|               \\_____________/            |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                        "\t\t|__________________________________________|\n";
            string bs_bazar16 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|            {Выход из города}             |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|{З.Ч.Б}____        |                      |\n" +
                        "\t\t|           \\_______|____|Таверна|         |\n" +
                        "\t\t|                   |                      |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                        "\t\t|         |_____             \\             |\n" +
                        "\t\t|               \\_____________*            |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                        "\t\t|__________________________________________|\n";
            string bs_bazar17 = "\n\n\t\t __________________________________________\n" +
                       "\t\t|            {Выход из города}             |\n" +
                       "\t\t|                   |                      |\n" +
                       "\t\t|{З.Ч.Б}____        |                      |\n" +
                       "\t\t|           \\_______|____|Таверна|         |\n" +
                       "\t\t|                   |                      |\n" +
                       "\t\t|                    \\                     |\n" +
                       "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                       "\t\t|         |_____             \\             |\n" +
                       "\t\t|               \\____________*/            |\n" +
                       "\t\t|                  |                       |\n" +
                       "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                       "\t\t|__________________________________________|\n";
            string bs_bazar18 = "\n\n\t\t __________________________________________\n" +
                       "\t\t|            {Выход из города}             |\n" +
                       "\t\t|                   |                      |\n" +
                       "\t\t|{З.Ч.Б}____        |                      |\n" +
                       "\t\t|           \\_______|____|Таверна|         |\n" +
                       "\t\t|                   |                      |\n" +
                       "\t\t|                    \\                     |\n" +
                       "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                       "\t\t|         |_____             \\             |\n" +
                       "\t\t|               \\___________*_/            |\n" +
                       "\t\t|                  |                       |\n" +
                       "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                       "\t\t|__________________________________________|\n";
            string bs_bazar19 = "\n\n\t\t __________________________________________\n" +
                       "\t\t|            {Выход из города}             |\n" +
                       "\t\t|                   |                      |\n" +
                       "\t\t|{З.Ч.Б}____        |                      |\n" +
                       "\t\t|           \\_______|____|Таверна|         |\n" +
                       "\t\t|                   |                      |\n" +
                       "\t\t|                    \\                     |\n" +
                       "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                       "\t\t|         |_____             \\             |\n" +
                       "\t\t|               \\__________*__/            |\n" +
                       "\t\t|                  |                       |\n" +
                       "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                       "\t\t|__________________________________________|\n";
            string bs_bazar20 = "\n\n\t\t __________________________________________\n" +
                       "\t\t|            {Выход из города}             |\n" +
                       "\t\t|                   |                      |\n" +
                       "\t\t|{З.Ч.Б}____        |                      |\n" +
                       "\t\t|           \\_______|____|Таверна|         |\n" +
                       "\t\t|                   |                      |\n" +
                       "\t\t|                    \\                     |\n" +
                       "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                       "\t\t|         |_____             \\             |\n" +
                       "\t\t|               \\_________*___/            |\n" +
                       "\t\t|                  |                       |\n" +
                       "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                       "\t\t|__________________________________________|\n";
            string bs_bazar21 = "\n\n\t\t __________________________________________\n" +
                       "\t\t|            {Выход из города}             |\n" +
                       "\t\t|                   |                      |\n" +
                       "\t\t|{З.Ч.Б}____        |                      |\n" +
                       "\t\t|           \\_______|____|Таверна|         |\n" +
                       "\t\t|                   |                      |\n" +
                       "\t\t|                    \\                     |\n" +
                       "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                       "\t\t|         |_____             \\             |\n" +
                       "\t\t|               \\________*____/            |\n" +
                       "\t\t|                  |                       |\n" +
                       "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                       "\t\t|__________________________________________|\n";
            string bs_bazar22 = "\n\n\t\t __________________________________________\n" +
                       "\t\t|            {Выход из города}             |\n" +
                       "\t\t|                   |                      |\n" +
                       "\t\t|{З.Ч.Б}____        |                      |\n" +
                       "\t\t|           \\_______|____|Таверна|         |\n" +
                       "\t\t|                   |                      |\n" +
                       "\t\t|                    \\                     |\n" +
                       "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                       "\t\t|         |_____             \\             |\n" +
                       "\t\t|               \\_______*_____/            |\n" +
                       "\t\t|                  |                       |\n" +
                       "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                       "\t\t|__________________________________________|\n";
            string bs_bazar23 = "\n\n\t\t __________________________________________\n" +
                       "\t\t|            {Выход из города}             |\n" +
                       "\t\t|                   |                      |\n" +
                       "\t\t|{З.Ч.Б}____        |                      |\n" +
                       "\t\t|           \\_______|____|Таверна|         |\n" +
                       "\t\t|                   |                      |\n" +
                       "\t\t|                    \\                     |\n" +
                       "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                       "\t\t|         |_____             \\             |\n" +
                       "\t\t|               \\______*______/            |\n" +
                       "\t\t|                  |                       |\n" +
                       "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                       "\t\t|__________________________________________|\n";
            string bs_bazar24 = "\n\n\t\t __________________________________________\n" +
                       "\t\t|            {Выход из города}             |\n" +
                       "\t\t|                   |                      |\n" +
                       "\t\t|{З.Ч.Б}____        |                      |\n" +
                       "\t\t|           \\_______|____|Таверна|         |\n" +
                       "\t\t|                   |                      |\n" +
                       "\t\t|                    \\                     |\n" +
                       "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                       "\t\t|         |_____             \\             |\n" +
                       "\t\t|               \\_____*_______/            |\n" +
                       "\t\t|                  |                       |\n" +
                       "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                       "\t\t|__________________________________________|\n";
            string bs_bazar25 = "\n\n\t\t __________________________________________\n" +
                       "\t\t|            {Выход из города}             |\n" +
                       "\t\t|                   |                      |\n" +
                       "\t\t|{З.Ч.Б}____        |                      |\n" +
                       "\t\t|           \\_______|____|Таверна|         |\n" +
                       "\t\t|                   |                      |\n" +
                       "\t\t|                    \\                     |\n" +
                       "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                       "\t\t|         |_____             \\             |\n" +
                       "\t\t|               \\____*________/            |\n" +
                       "\t\t|                  |                       |\n" +
                       "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                       "\t\t|__________________________________________|\n";
            string bs_bazar26 = "\n\n\t\t __________________________________________\n" +
                       "\t\t|            {Выход из города}             |\n" +
                       "\t\t|                   |                      |\n" +
                       "\t\t|{З.Ч.Б}____        |                      |\n" +
                       "\t\t|           \\_______|____|Таверна|         |\n" +
                       "\t\t|                   |                      |\n" +
                       "\t\t|                    \\                     |\n" +
                       "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                       "\t\t|         |_____             \\             |\n" +
                       "\t\t|               \\___*_________/            |\n" +
                       "\t\t|                  |                       |\n" +
                       "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                       "\t\t|__________________________________________|\n";
            string bs_bazar27 = "\n\n\t\t __________________________________________\n" +
                       "\t\t|            {Выход из города}             |\n" +
                       "\t\t|                   |                      |\n" +
                       "\t\t|{З.Ч.Б}____        |                      |\n" +
                       "\t\t|           \\_______|____|Таверна|         |\n" +
                       "\t\t|                   |                      |\n" +
                       "\t\t|                    \\                     |\n" +
                       "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                       "\t\t|         |_____             \\             |\n" +
                       "\t\t|               \\__*__________/            |\n" +
                       "\t\t|                  |                       |\n" +
                       "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                       "\t\t|__________________________________________|\n";
            string bs_bazar29 = "\n\n\t\t __________________________________________\n" +
                       "\t\t|            {Выход из города}             |\n" +
                       "\t\t|                   |                      |\n" +
                       "\t\t|{З.Ч.Б}____        |                      |\n" +
                       "\t\t|           \\_______|____|Таверна|         |\n" +
                       "\t\t|                   |                      |\n" +
                       "\t\t|                    \\                     |\n" +
                       "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                       "\t\t|         |_____             \\             |\n" +
                       "\t\t|               \\_____________/            |\n" +
                       "\t\t|                  *                       |\n" +
                       "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                       "\t\t|__________________________________________|\n";
            string bs_bazar30 = "\n\n\t\t __________________________________________\n" +
                       "\t\t|            {Выход из города}             |\n" +
                       "\t\t|                   |                      |\n" +
                       "\t\t|{З.Ч.Б}____        |                      |\n" +
                       "\t\t|           \\_______|____|Таверна|         |\n" +
                       "\t\t|                   |                      |\n" +
                       "\t\t|                    \\                     |\n" +
                       "\t\t|      |Рынок|        \\_____|Школа-Инт|    |\n" +
                       "\t\t|         |_____             \\             |\n" +
                       "\t\t|               \\_____________/            |\n" +
                       "\t\t|                  |                       |\n" +
                       "\t\t|      {Южная часть Бауэрстоуна}           |\n" +
                       "\t\t|__________________________________________|\n";
            for (int i = 0; i < 1; i++)
            {
                Console.Write(bs_bazar1);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_bazar2);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_bazar3);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_bazar4);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_bazar5);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_bazar6);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_bazar7);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_bazar8);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_bazar9);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_bazar10);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_bazar11);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_bazar12);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_bazar13);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_bazar14);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_bazar15);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_bazar16);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_bazar17);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_bazar18);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_bazar19);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_bazar20);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_bazar21);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_bazar22);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_bazar23);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_bazar24);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_bazar25);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_bazar26);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_bazar27);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_bazar29);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(bs_bazar30);
                Thread.Sleep(500);
                Console.Clear();
            }
        }

        public void Bowerstone_Schooll_Forest_GO_0()
        {
            Console.Clear();
            string l_1 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|                                          |\n" +
                        "\t\t|    _____          ____                   |\n" +
                        "\t\t|         \\            /          _____    |\n" +
                        "\t\t|          \\__________/          /         |\n" +
                        "\t\t|          /           \\        /          |\n" +
                        "\t\t||Школа|__/             \\______/           |\n" +
                        "\t\t|         \\                                |\n" +
                        "\t\t|          \\________                       |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|                     \\_____________       |\n" +
                        "\t\t|                                          |\n" +
                        "\t\t|__________________________________________|\n";
            string l_2 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|                                          |\n" +
                        "\t\t|    _____          ____                   |\n" +
                        "\t\t|         \\            /          _____    |\n" +
                        "\t\t|          \\__________/          /         |\n" +
                        "\t\t|          /           \\        /          |\n" +
                        "\t\t||Школа|*_/             \\______/           |\n" +
                        "\t\t|         \\                                |\n" +
                        "\t\t|          \\________                       |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|                     \\_____________       |\n" +
                        "\t\t|                                          |\n" +
                        "\t\t|__________________________________________|\n";
            string l_3 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|                                          |\n" +
                        "\t\t|    _____          ____                   |\n" +
                        "\t\t|         \\            /          _____    |\n" +
                        "\t\t|          \\__________/          /         |\n" +
                        "\t\t|          /           \\        /          |\n" +
                        "\t\t||Школа|_*/             \\______/           |\n" +
                        "\t\t|         \\                                |\n" +
                        "\t\t|          \\________                       |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|                     \\_____________       |\n" +
                        "\t\t|                                          |\n" +
                        "\t\t|__________________________________________|\n";
            string l_4 = "\n\n\t\t __________________________________________\n" +
                       "\t\t|                                          |\n" +
                       "\t\t|    _____          ____                   |\n" +
                       "\t\t|         \\            /          _____    |\n" +
                       "\t\t|          \\__________/          /         |\n" +
                       "\t\t|          /           \\        /          |\n" +
                       "\t\t||Школа|__*             \\______/           |\n" +
                       "\t\t|         \\                                |\n" +
                       "\t\t|          \\________                       |\n" +
                       "\t\t|                    \\                     |\n" +
                       "\t\t|                     \\_____________       |\n" +
                       "\t\t|                                          |\n" +
                       "\t\t|__________________________________________|\n";
            string l_5 = "\n\n\t\t __________________________________________\n" +
                      "\t\t|                                          |\n" +
                      "\t\t|    _____          ____                   |\n" +
                      "\t\t|         \\            /          _____    |\n" +
                      "\t\t|          \\__________/          /         |\n" +
                      "\t\t|          *           \\        /          |\n" +
                      "\t\t||Школа|__/             \\______/           |\n" +
                      "\t\t|         \\                                |\n" +
                      "\t\t|          \\________                       |\n" +
                      "\t\t|                    \\                     |\n" +
                      "\t\t|                     \\_____________       |\n" +
                      "\t\t|                                          |\n" +
                      "\t\t|__________________________________________|\n";
            string l_6 = "\n\n\t\t __________________________________________\n" +
                      "\t\t|                                          |\n" +
                      "\t\t|    _____          ____                   |\n" +
                      "\t\t|         \\            /          _____    |\n" +
                      "\t\t|          \\*_________/          /         |\n" +
                      "\t\t|          /           \\        /          |\n" +
                      "\t\t||Школа|__/             \\______/           |\n" +
                      "\t\t|         \\                                |\n" +
                      "\t\t|          \\________                       |\n" +
                      "\t\t|                    \\                     |\n" +
                      "\t\t|                     \\_____________       |\n" +
                      "\t\t|                                          |\n" +
                      "\t\t|__________________________________________|\n";
            for (int i = 0; i < 1; i++)
            {
                Console.Write(l_1);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_2);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_3);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_4);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_5);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_6);
                Thread.Sleep(500);
            }
        }
        public void Bowerstone_Schooll_Forest_GO_1()
        {
            Console.Clear();
            string l_6_1 = "\n\n\t\t __________________________________________\n" +
                      "\t\t|                                          |\n" +
                      "\t\t|    _____          ____                   |\n" +
                      "\t\t|         \\            /          _____    |\n" +
                      "\t\t|           *__________/          /         |\n" +
                      "\t\t|          /           \\        /          |\n" +
                      "\t\t||Школа|__/             \\______/           |\n" +
                      "\t\t|         \\                                |\n" +
                      "\t\t|          \\________                       |\n" +
                      "\t\t|                    \\                     |\n" +
                      "\t\t|                     \\_____________       |\n" +
                      "\t\t|                                          |\n" +
                      "\t\t|__________________________________________|\n";
            string l_6_2 = "\n\n\t\t __________________________________________\n" +
                      "\t\t|                                          |\n" +
                      "\t\t|    _____          ____                   |\n" +
                      "\t\t|          *            /          _____    |\n" +
                      "\t\t|          \\__________/          /         |\n" +
                      "\t\t|          /           \\        /          |\n" +
                      "\t\t||Школа|__/             \\______/           |\n" +
                      "\t\t|         \\                                |\n" +
                      "\t\t|          \\________                       |\n" +
                      "\t\t|                    \\                     |\n" +
                      "\t\t|                     \\_____________       |\n" +
                      "\t\t|                                          |\n" +
                      "\t\t|__________________________________________|\n";
            string l_6_3 = "\n\n\t\t __________________________________________\n" +
                      "\t\t|                                          |\n" +
                      "\t\t|    ____*          ____                   |\n" +
                      "\t\t|         \\            /          _____    |\n" +
                      "\t\t|          \\__________/          /         |\n" +
                      "\t\t|          /           \\        /          |\n" +
                      "\t\t||Школа|__/             \\______/           |\n" +
                      "\t\t|         \\                                |\n" +
                      "\t\t|          \\________                       |\n" +
                      "\t\t|                    \\                     |\n" +
                      "\t\t|                     \\_____________       |\n" +
                      "\t\t|                                          |\n" +
                      "\t\t|__________________________________________|\n";
            string l_6_4 = "\n\n\t\t __________________________________________\n" +
                      "\t\t|                                          |\n" +
                      "\t\t|    ___*_          ____                   |\n" +
                      "\t\t|         \\            /          _____    |\n" +
                      "\t\t|          \\__________/          /         |\n" +
                      "\t\t|          /           \\        /          |\n" +
                      "\t\t||Школа|__/             \\______/           |\n" +
                      "\t\t|         \\                                |\n" +
                      "\t\t|          \\________                       |\n" +
                      "\t\t|                    \\                     |\n" +
                      "\t\t|                     \\_____________       |\n" +
                      "\t\t|                                          |\n" +
                      "\t\t|__________________________________________|\n";
            string l_6_5 = "\n\n\t\t __________________________________________\n" +
                      "\t\t|                                          |\n" +
                      "\t\t|    __*__          ____                   |\n" +
                      "\t\t|         \\            /          _____    |\n" +
                      "\t\t|          \\__________/          /         |\n" +
                      "\t\t|          /           \\        /          |\n" +
                      "\t\t||Школа|__/             \\______/           |\n" +
                      "\t\t|         \\                                |\n" +
                      "\t\t|          \\________                       |\n" +
                      "\t\t|                    \\                     |\n" +
                      "\t\t|                     \\_____________       |\n" +
                      "\t\t|                                          |\n" +
                      "\t\t|__________________________________________|\n";
            string l_6_6 = "\n\n\t\t __________________________________________\n" +
                      "\t\t|                                          |\n" +
                      "\t\t|    _*___          ____                   |\n" +
                      "\t\t|         \\            /          _____    |\n" +
                      "\t\t|          \\__________/          /         |\n" +
                      "\t\t|          /           \\        /          |\n" +
                      "\t\t||Школа|__/             \\______/           |\n" +
                      "\t\t|         \\                                |\n" +
                      "\t\t|          \\________                       |\n" +
                      "\t\t|                    \\                     |\n" +
                      "\t\t|                     \\_____________       |\n" +
                      "\t\t|                                          |\n" +
                      "\t\t|__________________________________________|\n";
            string l_6_7 = "\n\n\t\t __________________________________________\n" +
                      "\t\t|                                          |\n" +
                      "\t\t|    *____          ____                   |\n" +
                      "\t\t|         \\            /          _____    |\n" +
                      "\t\t|          \\__________/          /         |\n" +
                      "\t\t|          /           \\        /          |\n" +
                      "\t\t||Школа|__/             \\______/           |\n" +
                      "\t\t|         \\                                |\n" +
                      "\t\t|          \\________                       |\n" +
                      "\t\t|                    \\                     |\n" +
                      "\t\t|                     \\_____________       |\n" +
                      "\t\t|                                          |\n" +
                      "\t\t|__________________________________________|\n";
            for (int i = 0; i < 1; i++)
            {
                Console.Write(l_6_1);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_6_2);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_6_3);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_6_4);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_6_5);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_6_6);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_6_7);
                Thread.Sleep(500);
                Console.Clear();
            }
        }

        public void Bowerstone_Schooll_Forest_GO_1_2()
        {
            Console.Clear();
            string l_6 = "\n\n\t\t __________________________________________\n" +
                      "\t\t|                                          |\n" +
                      "\t\t|    _____          ____                   |\n" +
                      "\t\t|         \\            /          _____    |\n" +
                      "\t\t|          \\*_________/          /         |\n" +
                      "\t\t|          /           \\        /          |\n" +
                      "\t\t||Школа|__/             \\______/           |\n" +
                      "\t\t|         \\                                |\n" +
                      "\t\t|          \\________                       |\n" +
                      "\t\t|                    \\                     |\n" +
                      "\t\t|                     \\_____________       |\n" +
                      "\t\t|                                          |\n" +
                      "\t\t|__________________________________________|\n";
            string l_7 = "\n\n\t\t __________________________________________\n" +
                      "\t\t|                                          |\n" +
                      "\t\t|    _____          ____                   |\n" +
                      "\t\t|         \\            /          _____    |\n" +
                      "\t\t|          \\_*________/          /         |\n" +
                      "\t\t|          /           \\        /          |\n" +
                      "\t\t||Школа|__/             \\______/           |\n" +
                      "\t\t|         \\                                |\n" +
                      "\t\t|          \\________                       |\n" +
                      "\t\t|                    \\                     |\n" +
                      "\t\t|                     \\_____________       |\n" +
                      "\t\t|                                          |\n" +
                      "\t\t|__________________________________________|\n";
            string l_8 = "\n\n\t\t __________________________________________\n" +
                      "\t\t|                                          |\n" +
                      "\t\t|    _____          ____                   |\n" +
                      "\t\t|         \\            /          _____    |\n" +
                      "\t\t|          \\__*_______/          /         |\n" +
                      "\t\t|          /           \\        /          |\n" +
                      "\t\t||Школа|__/             \\______/           |\n" +
                      "\t\t|         \\                                |\n" +
                      "\t\t|          \\________                       |\n" +
                      "\t\t|                    \\                     |\n" +
                      "\t\t|                     \\_____________       |\n" +
                      "\t\t|                                          |\n" +
                      "\t\t|__________________________________________|\n";
            string l_9 = "\n\n\t\t __________________________________________\n" +
                      "\t\t|                                          |\n" +
                      "\t\t|    _____          ____                   |\n" +
                      "\t\t|         \\            /          _____    |\n" +
                      "\t\t|          \\___*______/          /         |\n" +
                      "\t\t|          /           \\        /          |\n" +
                      "\t\t||Школа|__/             \\______/           |\n" +
                      "\t\t|         \\                                |\n" +
                      "\t\t|          \\________                       |\n" +
                      "\t\t|                    \\                     |\n" +
                      "\t\t|                     \\_____________       |\n" +
                      "\t\t|                                          |\n" +
                      "\t\t|__________________________________________|\n";
            string l_10 = "\n\n\t\t __________________________________________\n" +
                      "\t\t|                                          |\n" +
                      "\t\t|    _____          ____                   |\n" +
                      "\t\t|         \\            /          _____    |\n" +
                      "\t\t|          \\____*_____/          /         |\n" +
                      "\t\t|          /           \\        /          |\n" +
                      "\t\t||Школа|__/             \\______/           |\n" +
                      "\t\t|         \\                                |\n" +
                      "\t\t|          \\________                       |\n" +
                      "\t\t|                    \\                     |\n" +
                      "\t\t|                     \\_____________       |\n" +
                      "\t\t|                                          |\n" +
                      "\t\t|__________________________________________|\n";
            string l_11 = "\n\n\t\t __________________________________________\n" +
                      "\t\t|                                          |\n" +
                      "\t\t|    _____          ____                   |\n" +
                      "\t\t|         \\            /          _____    |\n" +
                      "\t\t|          \\_____*____/          /         |\n" +
                      "\t\t|          /           \\        /          |\n" +
                      "\t\t||Школа|__/             \\______/           |\n" +
                      "\t\t|         \\                                |\n" +
                      "\t\t|          \\________                       |\n" +
                      "\t\t|                    \\                     |\n" +
                      "\t\t|                     \\_____________       |\n" +
                      "\t\t|                                          |\n" +
                      "\t\t|__________________________________________|\n";
            string l_12 = "\n\n\t\t __________________________________________\n" +
                      "\t\t|                                          |\n" +
                      "\t\t|    _____          ____                   |\n" +
                      "\t\t|         \\            /          _____    |\n" +
                      "\t\t|          \\______*___/          /         |\n" +
                      "\t\t|          /           \\        /          |\n" +
                      "\t\t||Школа|__/             \\______/           |\n" +
                      "\t\t|         \\                                |\n" +
                      "\t\t|          \\________                       |\n" +
                      "\t\t|                    \\                     |\n" +
                      "\t\t|                     \\_____________       |\n" +
                      "\t\t|                                          |\n" +
                      "\t\t|__________________________________________|\n";
            string l_13 = "\n\n\t\t __________________________________________\n" +
                      "\t\t|                                          |\n" +
                      "\t\t|    _____          ____                   |\n" +
                      "\t\t|         \\            /          _____    |\n" +
                      "\t\t|          \\_______*__/          /         |\n" +
                      "\t\t|          /           \\        /          |\n" +
                      "\t\t||Школа|__/             \\______/           |\n" +
                      "\t\t|         \\                                |\n" +
                      "\t\t|          \\________                       |\n" +
                      "\t\t|                    \\                     |\n" +
                      "\t\t|                     \\_____________       |\n" +
                      "\t\t|                                          |\n" +
                      "\t\t|__________________________________________|\n";
            string l_14 = "\n\n\t\t __________________________________________\n" +
                      "\t\t|                                          |\n" +
                      "\t\t|    _____          ____                   |\n" +
                      "\t\t|         \\            /          _____    |\n" +
                      "\t\t|          \\________*_/          /         |\n" +
                      "\t\t|          /           \\        /          |\n" +
                      "\t\t||Школа|__/             \\______/           |\n" +
                      "\t\t|         \\                                |\n" +
                      "\t\t|          \\________                       |\n" +
                      "\t\t|                    \\                     |\n" +
                      "\t\t|                     \\_____________       |\n" +
                      "\t\t|                                          |\n" +
                      "\t\t|__________________________________________|\n";
            string l_15 = "\n\n\t\t __________________________________________\n" +
                      "\t\t|                                          |\n" +
                      "\t\t|    _____          ____                   |\n" +
                      "\t\t|         \\            /          _____    |\n" +
                      "\t\t|          \\_________*/          /         |\n" +
                      "\t\t|          /           \\        /          |\n" +
                      "\t\t||Школа|__/             \\______/           |\n" +
                      "\t\t|         \\                                |\n" +
                      "\t\t|          \\________                       |\n" +
                      "\t\t|                    \\                     |\n" +
                      "\t\t|                     \\_____________       |\n" +
                      "\t\t|                                          |\n" +
                      "\t\t|__________________________________________|\n";
            for (int i = 0; i < 1; i++)
            {
                Console.Write(l_7);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_8);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_9);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_10);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_11);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_12);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_13);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_14);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_15);
                Thread.Sleep(500);
            }
        }
        public void Bowerstone_Schooll_Forest_GO_2()
        {
            Console.Clear();
            string l_15 = "\n\n\t\t __________________________________________\n" +
                      "\t\t|                                          |\n" +
                      "\t\t|    _____          ____                   |\n" +
                      "\t\t|         \\            /          _____    |\n" +
                      "\t\t|          \\_________*/          /         |\n" +
                      "\t\t|          /           \\        /          |\n" +
                      "\t\t||Школа|__/             \\______/           |\n" +
                      "\t\t|         \\                                |\n" +
                      "\t\t|          \\________                       |\n" +
                      "\t\t|                    \\                     |\n" +
                      "\t\t|                     \\_____________       |\n" +
                      "\t\t|                                          |\n" +
                      "\t\t|__________________________________________|\n";
            string l_16 = "\n\n\t\t __________________________________________\n" +
                      "\t\t|                                          |\n" +
                      "\t\t|    _____          ____                   |\n" +
                      "\t\t|         \\            /          _____    |\n" +
                      "\t\t|          \\__________*          /         |\n" +
                      "\t\t|          /           \\        /          |\n" +
                      "\t\t||Школа|__/             \\______/           |\n" +
                      "\t\t|         \\                                |\n" +
                      "\t\t|          \\________                       |\n" +
                      "\t\t|                    \\                     |\n" +
                      "\t\t|                     \\_____________       |\n" +
                      "\t\t|                                          |\n" +
                      "\t\t|__________________________________________|\n";
            string l_17 = "\n\n\t\t __________________________________________\n" +
                     "\t\t|                                          |\n" +
                     "\t\t|    _____          ____                   |\n" +
                     "\t\t|         \\            *          _____    |\n" +
                     "\t\t|          \\__________/          /         |\n" +
                     "\t\t|          /           \\        /          |\n" +
                     "\t\t||Школа|__/             \\______/           |\n" +
                     "\t\t|         \\                                |\n" +
                     "\t\t|          \\________                       |\n" +
                     "\t\t|                    \\                     |\n" +
                     "\t\t|                     \\_____________       |\n" +
                     "\t\t|                                          |\n" +
                     "\t\t|__________________________________________|\n";
            string l_18 = "\n\n\t\t __________________________________________\n" +
                     "\t\t|                                          |\n" +
                     "\t\t|    _____          ___*                   |\n" +
                     "\t\t|         \\            /          _____    |\n" +
                     "\t\t|          \\__________/          /         |\n" +
                     "\t\t|          /           \\        /          |\n" +
                     "\t\t||Школа|__/             \\______/           |\n" +
                     "\t\t|         \\                                |\n" +
                     "\t\t|          \\________                       |\n" +
                     "\t\t|                    \\                     |\n" +
                     "\t\t|                     \\_____________       |\n" +
                     "\t\t|                                          |\n" +
                     "\t\t|__________________________________________|\n";
            string l_19 = "\n\n\t\t __________________________________________\n" +
                     "\t\t|                                          |\n" +
                     "\t\t|    _____          __*_                   |\n" +
                     "\t\t|         \\            /          _____    |\n" +
                     "\t\t|          \\__________/          /         |\n" +
                     "\t\t|          /           \\        /          |\n" +
                     "\t\t||Школа|__/             \\______/           |\n" +
                     "\t\t|         \\                                |\n" +
                     "\t\t|          \\________                       |\n" +
                     "\t\t|                    \\                     |\n" +
                     "\t\t|                     \\_____________       |\n" +
                     "\t\t|                                          |\n" +
                     "\t\t|__________________________________________|\n";
            string l_20 = "\n\n\t\t __________________________________________\n" +
                     "\t\t|                                          |\n" +
                     "\t\t|    _____          _*__                   |\n" +
                     "\t\t|         \\            /          _____    |\n" +
                     "\t\t|          \\__________/          /         |\n" +
                     "\t\t|          /           \\        /          |\n" +
                     "\t\t||Школа|__/             \\______/           |\n" +
                     "\t\t|         \\                                |\n" +
                     "\t\t|          \\________                       |\n" +
                     "\t\t|                    \\                     |\n" +
                     "\t\t|                     \\_____________       |\n" +
                     "\t\t|                                          |\n" +
                     "\t\t|__________________________________________|\n";
            string l_21 = "\n\n\t\t __________________________________________\n" +
                     "\t\t|                                          |\n" +
                     "\t\t|    _____          *___                   |\n" +
                     "\t\t|         \\            /          _____    |\n" +
                     "\t\t|          \\__________/          /         |\n" +
                     "\t\t|          /           \\        /          |\n" +
                     "\t\t||Школа|__/             \\______/           |\n" +
                     "\t\t|         \\                                |\n" +
                     "\t\t|          \\________                       |\n" +
                     "\t\t|                    \\                     |\n" +
                     "\t\t|                     \\_____________       |\n" +
                     "\t\t|                                          |\n" +
                     "\t\t|__________________________________________|\n";
            for (int i = 0; i < 1; i++)
            {
                
                Console.Write(l_15);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_16);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_17);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_18);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_19);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_20);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_21);
                Thread.Sleep(500);
                Console.Clear();

            }
        }

        public void Bowerstone_Schooll_Forest_GO_3()
        {
            Console.Clear();
            string l_15 = "\n\n\t\t __________________________________________\n" +
                      "\t\t|                                          |\n" +
                      "\t\t|    _____          ____                   |\n" +
                      "\t\t|         \\            /          _____    |\n" +
                      "\t\t|          \\_________*/          /         |\n" +
                      "\t\t|          /           \\        /          |\n" +
                      "\t\t||Школа|__/             \\______/           |\n" +
                      "\t\t|         \\                                |\n" +
                      "\t\t|          \\________                       |\n" +
                      "\t\t|                    \\                     |\n" +
                      "\t\t|                     \\_____________       |\n" +
                      "\t\t|                                          |\n" +
                      "\t\t|__________________________________________|\n";
            string l_16 = "\n\n\t\t __________________________________________\n" +
                      "\t\t|                                          |\n" +
                      "\t\t|    _____          ____                   |\n" +
                      "\t\t|         \\            /          _____    |\n" +
                      "\t\t|          \\__________/          /         |\n" +
                      "\t\t|          /           *        /          |\n" +
                      "\t\t||Школа|__/             \\______/           |\n" +
                      "\t\t|         \\                                |\n" +
                      "\t\t|          \\________                       |\n" +
                      "\t\t|                    \\                     |\n" +
                      "\t\t|                     \\_____________       |\n" +
                      "\t\t|                                          |\n" +
                      "\t\t|__________________________________________|\n";
            string l_17 = "\n\n\t\t __________________________________________\n" +
                      "\t\t|                                          |\n" +
                      "\t\t|    _____          ____                   |\n" +
                      "\t\t|         \\            /          _____    |\n" +
                      "\t\t|          \\__________/          /         |\n" +
                      "\t\t|          /           \\        /          |\n" +
                      "\t\t||Школа|__/             *______/           |\n" +
                      "\t\t|         \\                                |\n" +
                      "\t\t|          \\________                       |\n" +
                      "\t\t|                    \\                     |\n" +
                      "\t\t|                     \\_____________       |\n" +
                      "\t\t|                                          |\n" +
                      "\t\t|__________________________________________|\n";
            string l_18 = "\n\n\t\t __________________________________________\n" +
                      "\t\t|                                          |\n" +
                      "\t\t|    _____          ____                   |\n" +
                      "\t\t|         \\            /          _____    |\n" +
                      "\t\t|          \\__________/          /         |\n" +
                      "\t\t|          /           \\        /          |\n" +
                      "\t\t||Школа|__/             \\*_____/           |\n" +
                      "\t\t|         \\                                |\n" +
                      "\t\t|          \\________                       |\n" +
                      "\t\t|                    \\                     |\n" +
                      "\t\t|                     \\_____________       |\n" +
                      "\t\t|                                          |\n" +
                      "\t\t|__________________________________________|\n";
            string l_19 = "\n\n\t\t __________________________________________\n" +
                      "\t\t|                                          |\n" +
                      "\t\t|    _____          ____                   |\n" +
                      "\t\t|         \\            /          _____    |\n" +
                      "\t\t|          \\__________/          /         |\n" +
                      "\t\t|          /           \\        /          |\n" +
                      "\t\t||Школа|__/             \\_*____/           |\n" +
                      "\t\t|         \\                                |\n" +
                      "\t\t|          \\________                       |\n" +
                      "\t\t|                    \\                     |\n" +
                      "\t\t|                     \\_____________       |\n" +
                      "\t\t|                                          |\n" +
                      "\t\t|__________________________________________|\n";
            string l_20 = "\n\n\t\t __________________________________________\n" +
                      "\t\t|                                          |\n" +
                      "\t\t|    _____          ____                   |\n" +
                      "\t\t|         \\            /          _____    |\n" +
                      "\t\t|          \\__________/          /         |\n" +
                      "\t\t|          /           \\        /          |\n" +
                      "\t\t||Школа|__/             \\__*___/           |\n" +
                      "\t\t|         \\                                |\n" +
                      "\t\t|          \\________                       |\n" +
                      "\t\t|                    \\                     |\n" +
                      "\t\t|                     \\_____________       |\n" +
                      "\t\t|                                          |\n" +
                      "\t\t|__________________________________________|\n";
            string l_21 = "\n\n\t\t __________________________________________\n" +
                      "\t\t|                                          |\n" +
                      "\t\t|    _____          ____                   |\n" +
                      "\t\t|         \\            /          _____    |\n" +
                      "\t\t|          \\__________/          /         |\n" +
                      "\t\t|          /           \\        /          |\n" +
                      "\t\t||Школа|__/             \\___*__/           |\n" +
                      "\t\t|         \\                                |\n" +
                      "\t\t|          \\________                       |\n" +
                      "\t\t|                    \\                     |\n" +
                      "\t\t|                     \\_____________       |\n" +
                      "\t\t|                                          |\n" +
                      "\t\t|__________________________________________|\n";
            string l_22 = "\n\n\t\t __________________________________________\n" +
                      "\t\t|                                          |\n" +
                      "\t\t|    _____          ____                   |\n" +
                      "\t\t|         \\            /          _____    |\n" +
                      "\t\t|          \\__________/          /         |\n" +
                      "\t\t|          /           \\        /          |\n" +
                      "\t\t||Школа|__/             \\____*_/           |\n" +
                      "\t\t|         \\                                |\n" +
                      "\t\t|          \\________                       |\n" +
                      "\t\t|                    \\                     |\n" +
                      "\t\t|                     \\_____________       |\n" +
                      "\t\t|                                          |\n" +
                      "\t\t|__________________________________________|\n";
            string l_23 = "\n\n\t\t __________________________________________\n" +
                      "\t\t|                                          |\n" +
                      "\t\t|    _____          ____                   |\n" +
                      "\t\t|         \\            /          _____    |\n" +
                      "\t\t|          \\__________/          /         |\n" +
                      "\t\t|          /           \\        /          |\n" +
                      "\t\t||Школа|__/             \\_____*/           |\n" +
                      "\t\t|         \\                                |\n" +
                      "\t\t|          \\________                       |\n" +
                      "\t\t|                    \\                     |\n" +
                      "\t\t|                     \\_____________       |\n" +
                      "\t\t|                                          |\n" +
                      "\t\t|__________________________________________|\n";
            string l_24 = "\n\n\t\t __________________________________________\n" +
                     "\t\t|                                          |\n" +
                     "\t\t|    _____          ____                   |\n" +
                     "\t\t|         \\            /          _____    |\n" +
                     "\t\t|          \\__________/          /         |\n" +
                     "\t\t|          /           \\        /          |\n" +
                     "\t\t||Школа|__/             \\______*           |\n" +
                     "\t\t|         \\                                |\n" +
                     "\t\t|          \\________                       |\n" +
                     "\t\t|                    \\                     |\n" +
                     "\t\t|                     \\_____________       |\n" +
                     "\t\t|                                          |\n" +
                     "\t\t|__________________________________________|\n";
            string l_25 = "\n\n\t\t __________________________________________\n" +
                     "\t\t|                                          |\n" +
                     "\t\t|    _____          ____                   |\n" +
                     "\t\t|         \\            /          _____    |\n" +
                     "\t\t|          \\__________/          /         |\n" +
                     "\t\t|          /           \\        *          |\n" +
                     "\t\t||Школа|__/             \\______/           |\n" +
                     "\t\t|         \\                                |\n" +
                     "\t\t|          \\________                       |\n" +
                     "\t\t|                    \\                     |\n" +
                     "\t\t|                     \\_____________       |\n" +
                     "\t\t|                                          |\n" +
                     "\t\t|__________________________________________|\n";
            string l_26 = "\n\n\t\t __________________________________________\n" +
                    "\t\t|                                          |\n" +
                    "\t\t|    _____          ____                   |\n" +
                    "\t\t|         \\            /          _____    |\n" +
                    "\t\t|          \\__________/          *         |\n" +
                    "\t\t|          /           \\        /          |\n" +
                    "\t\t||Школа|__/             \\______/           |\n" +
                    "\t\t|         \\                                |\n" +
                    "\t\t|          \\________                       |\n" +
                    "\t\t|                    \\                     |\n" +
                    "\t\t|                     \\_____________       |\n" +
                    "\t\t|                                          |\n" +
                    "\t\t|__________________________________________|\n";
            string l_27 = "\n\n\t\t __________________________________________\n" +
                    "\t\t|                                          |\n" +
                    "\t\t|    _____          ____                   |\n" +
                    "\t\t|         \\            /          *____    |\n" +
                    "\t\t|          \\__________/          /         |\n" +
                    "\t\t|          /           \\        /          |\n" +
                    "\t\t||Школа|__/             \\______/           |\n" +
                    "\t\t|         \\                                |\n" +
                    "\t\t|          \\________                       |\n" +
                    "\t\t|                    \\                     |\n" +
                    "\t\t|                     \\_____________       |\n" +
                    "\t\t|                                          |\n" +
                    "\t\t|__________________________________________|\n";
            string l_28 = "\n\n\t\t __________________________________________\n" +
                    "\t\t|                                          |\n" +
                    "\t\t|    _____          ____                   |\n" +
                    "\t\t|         \\            /          _*___    |\n" +
                    "\t\t|          \\__________/          /         |\n" +
                    "\t\t|          /           \\        /          |\n" +
                    "\t\t||Школа|__/             \\______/           |\n" +
                    "\t\t|         \\                                |\n" +
                    "\t\t|          \\________                       |\n" +
                    "\t\t|                    \\                     |\n" +
                    "\t\t|                     \\_____________       |\n" +
                    "\t\t|                                          |\n" +
                    "\t\t|__________________________________________|\n";
            string l_29 = "\n\n\t\t __________________________________________\n" +
                    "\t\t|                                          |\n" +
                    "\t\t|    _____          ____                   |\n" +
                    "\t\t|         \\            /          __*__    |\n" +
                    "\t\t|          \\__________/          /         |\n" +
                    "\t\t|          /           \\        /          |\n" +
                    "\t\t||Школа|__/             \\______/           |\n" +
                    "\t\t|         \\                                |\n" +
                    "\t\t|          \\________                       |\n" +
                    "\t\t|                    \\                     |\n" +
                    "\t\t|                     \\_____________       |\n" +
                    "\t\t|                                          |\n" +
                    "\t\t|__________________________________________|\n";
            string l_30 = "\n\n\t\t __________________________________________\n" +
                    "\t\t|                                          |\n" +
                    "\t\t|    _____          ____                   |\n" +
                    "\t\t|         \\            /          ___*_    |\n" +
                    "\t\t|          \\__________/          /         |\n" +
                    "\t\t|          /           \\        /          |\n" +
                    "\t\t||Школа|__/             \\______/           |\n" +
                    "\t\t|         \\                                |\n" +
                    "\t\t|          \\________                       |\n" +
                    "\t\t|                    \\                     |\n" +
                    "\t\t|                     \\_____________       |\n" +
                    "\t\t|                                          |\n" +
                    "\t\t|__________________________________________|\n";
            string l_31 = "\n\n\t\t __________________________________________\n" +
                   "\t\t|                                          |\n" +
                   "\t\t|    _____          ____                   |\n" +
                   "\t\t|         \\            /          ____*    |\n" +
                   "\t\t|          \\__________/          /         |\n" +
                   "\t\t|          /           \\        /          |\n" +
                   "\t\t||Школа|__/             \\______/           |\n" +
                   "\t\t|         \\                                |\n" +
                   "\t\t|          \\________                       |\n" +
                   "\t\t|                    \\                     |\n" +
                   "\t\t|                     \\_____________       |\n" +
                   "\t\t|                                          |\n" +
                   "\t\t|__________________________________________|\n";
            for (int i = 0; i < 1; i++)
            {
                Console.Write(l_15);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_16);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_17);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_18);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_19);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_20);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_21);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_22);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_23);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_24);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_25);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_26);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_27);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_28);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_29);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_30);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_31);
                Thread.Sleep(500);
                Console.Clear();
            }
        }

        public void Bowerstone_Schooll_Forest_GO_4()
        {
            Console.Clear();
            string l_1 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|                                          |\n" +
                        "\t\t|    _____          ____                   |\n" +
                        "\t\t|         \\            /          _____    |\n" +
                        "\t\t|          \\__________/          /         |\n" +
                        "\t\t|          /           \\        /          |\n" +
                        "\t\t||Школа|__/             \\______/           |\n" +
                        "\t\t|         \\                                |\n" +
                        "\t\t|          \\________                       |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|                     \\_____________       |\n" +
                        "\t\t|                                          |\n" +
                        "\t\t|__________________________________________|\n";
            string l_2 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|                                          |\n" +
                        "\t\t|    _____          ____                   |\n" +
                        "\t\t|         \\            /          _____    |\n" +
                        "\t\t|          \\__________/          /         |\n" +
                        "\t\t|          /           \\        /          |\n" +
                        "\t\t||Школа|*_/             \\______/           |\n" +
                        "\t\t|         \\                                |\n" +
                        "\t\t|          \\________                       |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|                     \\_____________       |\n" +
                        "\t\t|                                          |\n" +
                        "\t\t|__________________________________________|\n";
            string l_3 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|                                          |\n" +
                        "\t\t|    _____          ____                   |\n" +
                        "\t\t|         \\            /          _____    |\n" +
                        "\t\t|          \\__________/          /         |\n" +
                        "\t\t|          /           \\        /          |\n" +
                        "\t\t||Школа|_*/             \\______/           |\n" +
                        "\t\t|         \\                                |\n" +
                        "\t\t|          \\________                       |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|                     \\_____________       |\n" +
                        "\t\t|                                          |\n" +
                        "\t\t|__________________________________________|\n";
            string l_4 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|                                          |\n" +
                        "\t\t|    _____          ____                   |\n" +
                        "\t\t|         \\            /          _____    |\n" +
                        "\t\t|          \\__________/          /         |\n" +
                        "\t\t|          /           \\        /          |\n" +
                        "\t\t||Школа|__/             \\______/           |\n" +
                        "\t\t|         *                                |\n" +
                        "\t\t|          \\________                       |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|                     \\_____________       |\n" +
                        "\t\t|                                          |\n" +
                        "\t\t|__________________________________________|\n";
            string l_5 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|                                          |\n" +
                        "\t\t|    _____          ____                   |\n" +
                        "\t\t|         \\            /          _____    |\n" +
                        "\t\t|          \\__________/          /         |\n" +
                        "\t\t|          /           \\        /          |\n" +
                        "\t\t||Школа|__/             \\______/           |\n" +
                        "\t\t|         \\                                |\n" +
                        "\t\t|          *________                       |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|                     \\_____________       |\n" +
                        "\t\t|                                          |\n" +
                        "\t\t|__________________________________________|\n";
            string l_6 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|                                          |\n" +
                        "\t\t|    _____          ____                   |\n" +
                        "\t\t|         \\            /          _____    |\n" +
                        "\t\t|          \\__________/          /         |\n" +
                        "\t\t|          /           \\        /          |\n" +
                        "\t\t||Школа|__/             \\______/           |\n" +
                        "\t\t|         \\                                |\n" +
                        "\t\t|          \\*_______                       |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|                     \\_____________       |\n" +
                        "\t\t|                                          |\n" +
                        "\t\t|__________________________________________|\n";
            string l_7 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|                                          |\n" +
                        "\t\t|    _____          ____                   |\n" +
                        "\t\t|         \\            /          _____    |\n" +
                        "\t\t|          \\__________/          /         |\n" +
                        "\t\t|          /           \\        /          |\n" +
                        "\t\t||Школа|__/             \\______/           |\n" +
                        "\t\t|         \\                                |\n" +
                        "\t\t|          \\_*______                       |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|                     \\_____________       |\n" +
                        "\t\t|                                          |\n" +
                        "\t\t|__________________________________________|\n";
            string l_8 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|                                          |\n" +
                        "\t\t|    _____          ____                   |\n" +
                        "\t\t|         \\            /          _____    |\n" +
                        "\t\t|          \\__________/          /         |\n" +
                        "\t\t|          /           \\        /          |\n" +
                        "\t\t||Школа|__/             \\______/           |\n" +
                        "\t\t|         \\                                |\n" +
                        "\t\t|          \\__*_____                       |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|                     \\_____________       |\n" +
                        "\t\t|                                          |\n" +
                        "\t\t|__________________________________________|\n";
            string l_9 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|                                          |\n" +
                        "\t\t|    _____          ____                   |\n" +
                        "\t\t|         \\            /          _____    |\n" +
                        "\t\t|          \\__________/          /         |\n" +
                        "\t\t|          /           \\        /          |\n" +
                        "\t\t||Школа|__/             \\______/           |\n" +
                        "\t\t|         \\                                |\n" +
                        "\t\t|          \\___*____                       |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|                     \\_____________       |\n" +
                        "\t\t|                                          |\n" +
                        "\t\t|__________________________________________|\n";
            string l_10 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|                                          |\n" +
                        "\t\t|    _____          ____                   |\n" +
                        "\t\t|         \\            /          _____    |\n" +
                        "\t\t|          \\__________/          /         |\n" +
                        "\t\t|          /           \\        /          |\n" +
                        "\t\t||Школа|__/             \\______/           |\n" +
                        "\t\t|         \\                                |\n" +
                        "\t\t|          \\____*___                       |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|                     \\_____________       |\n" +
                        "\t\t|                                          |\n" +
                        "\t\t|__________________________________________|\n";
            string l_11 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|                                          |\n" +
                        "\t\t|    _____          ____                   |\n" +
                        "\t\t|         \\            /          _____    |\n" +
                        "\t\t|          \\__________/          /         |\n" +
                        "\t\t|          /           \\        /          |\n" +
                        "\t\t||Школа|__/             \\______/           |\n" +
                        "\t\t|         \\                                |\n" +
                        "\t\t|          \\_____*__                       |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|                     \\_____________       |\n" +
                        "\t\t|                                          |\n" +
                        "\t\t|__________________________________________|\n";
            string l_12 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|                                          |\n" +
                        "\t\t|    _____          ____                   |\n" +
                        "\t\t|         \\            /          _____    |\n" +
                        "\t\t|          \\__________/          /         |\n" +
                        "\t\t|          /           \\        /          |\n" +
                        "\t\t||Школа|__/             \\______/           |\n" +
                        "\t\t|         \\                                |\n" +
                        "\t\t|          \\______*_                       |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|                     \\_____________       |\n" +
                        "\t\t|                                          |\n" +
                        "\t\t|__________________________________________|\n";
            string l_13 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|                                          |\n" +
                        "\t\t|    _____          ____                   |\n" +
                        "\t\t|         \\            /          _____    |\n" +
                        "\t\t|          \\__________/          /         |\n" +
                        "\t\t|          /           \\        /          |\n" +
                        "\t\t||Школа|__/             \\______/           |\n" +
                        "\t\t|         \\                                |\n" +
                        "\t\t|          \\_______*                       |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|                     \\_____________       |\n" +
                        "\t\t|                                          |\n" +
                        "\t\t|__________________________________________|\n";
            string l_14 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|                                          |\n" +
                        "\t\t|    _____          ____                   |\n" +
                        "\t\t|         \\            /          _____    |\n" +
                        "\t\t|          \\__________/          /         |\n" +
                        "\t\t|          /           \\        /          |\n" +
                        "\t\t||Школа|__/             \\______/           |\n" +
                        "\t\t|         \\                                |\n" +
                        "\t\t|          \\________                       |\n" +
                        "\t\t|                    *                     |\n" +
                        "\t\t|                     \\_____________       |\n" +
                        "\t\t|                                          |\n" +
                        "\t\t|__________________________________________|\n";
            string l_15 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|                                          |\n" +
                        "\t\t|    _____          ____                   |\n" +
                        "\t\t|         \\            /          _____    |\n" +
                        "\t\t|          \\__________/          /         |\n" +
                        "\t\t|          /           \\        /          |\n" +
                        "\t\t||Школа|__/             \\______/           |\n" +
                        "\t\t|         \\                                |\n" +
                        "\t\t|          \\________                       |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|                     *_____________       |\n" +
                        "\t\t|                                          |\n" +
                        "\t\t|__________________________________________|\n";
            string l_16 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|                                          |\n" +
                        "\t\t|    _____          ____                   |\n" +
                        "\t\t|         \\            /          _____    |\n" +
                        "\t\t|          \\__________/          /         |\n" +
                        "\t\t|          /           \\        /          |\n" +
                        "\t\t||Школа|__/             \\______/           |\n" +
                        "\t\t|         \\                                |\n" +
                        "\t\t|          \\________                       |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|                     \\*____________       |\n" +
                        "\t\t|                                          |\n" +
                        "\t\t|__________________________________________|\n";
            string l_17 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|                                          |\n" +
                        "\t\t|    _____          ____                   |\n" +
                        "\t\t|         \\            /          _____    |\n" +
                        "\t\t|          \\__________/          /         |\n" +
                        "\t\t|          /           \\        /          |\n" +
                        "\t\t||Школа|__/             \\______/           |\n" +
                        "\t\t|         \\                                |\n" +
                        "\t\t|          \\________                       |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|                     \\_*___________       |\n" +
                        "\t\t|                                          |\n" +
                        "\t\t|__________________________________________|\n";
            string l_18 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|                                          |\n" +
                        "\t\t|    _____          ____                   |\n" +
                        "\t\t|         \\            /          _____    |\n" +
                        "\t\t|          \\__________/          /         |\n" +
                        "\t\t|          /           \\        /          |\n" +
                        "\t\t||Школа|__/             \\______/           |\n" +
                        "\t\t|         \\                                |\n" +
                        "\t\t|          \\________                       |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|                     \\__*__________       |\n" +
                        "\t\t|                                          |\n" +
                        "\t\t|__________________________________________|\n";
            string l_19 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|                                          |\n" +
                        "\t\t|    _____          ____                   |\n" +
                        "\t\t|         \\            /          _____    |\n" +
                        "\t\t|          \\__________/          /         |\n" +
                        "\t\t|          /           \\        /          |\n" +
                        "\t\t||Школа|__/             \\______/           |\n" +
                        "\t\t|         \\                                |\n" +
                        "\t\t|          \\________                       |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|                     \\___*_________       |\n" +
                        "\t\t|                                          |\n" +
                        "\t\t|__________________________________________|\n";
            string l_20 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|                                          |\n" +
                        "\t\t|    _____          ____                   |\n" +
                        "\t\t|         \\            /          _____    |\n" +
                        "\t\t|          \\__________/          /         |\n" +
                        "\t\t|          /           \\        /          |\n" +
                        "\t\t||Школа|__/             \\______/           |\n" +
                        "\t\t|         \\                                |\n" +
                        "\t\t|          \\________                       |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|                     \\____*________       |\n" +
                        "\t\t|                                          |\n" +
                        "\t\t|__________________________________________|\n";
            string l_21 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|                                          |\n" +
                        "\t\t|    _____          ____                   |\n" +
                        "\t\t|         \\            /          _____    |\n" +
                        "\t\t|          \\__________/          /         |\n" +
                        "\t\t|          /           \\        /          |\n" +
                        "\t\t||Школа|__/             \\______/           |\n" +
                        "\t\t|         \\                                |\n" +
                        "\t\t|          \\________                       |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|                     \\_____*_______       |\n" +
                        "\t\t|                                          |\n" +
                        "\t\t|__________________________________________|\n";
            string l_22 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|                                          |\n" +
                        "\t\t|    _____          ____                   |\n" +
                        "\t\t|         \\            /          _____    |\n" +
                        "\t\t|          \\__________/          /         |\n" +
                        "\t\t|          /           \\        /          |\n" +
                        "\t\t||Школа|__/             \\______/           |\n" +
                        "\t\t|         \\                                |\n" +
                        "\t\t|          \\________                       |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|                     \\______*______       |\n" +
                        "\t\t|                                          |\n" +
                        "\t\t|__________________________________________|\n";
            string l_23 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|                                          |\n" +
                        "\t\t|    _____          ____                   |\n" +
                        "\t\t|         \\            /          _____    |\n" +
                        "\t\t|          \\__________/          /         |\n" +
                        "\t\t|          /           \\        /          |\n" +
                        "\t\t||Школа|__/             \\______/           |\n" +
                        "\t\t|         \\                                |\n" +
                        "\t\t|          \\________                       |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|                     \\_______*_____       |\n" +
                        "\t\t|                                          |\n" +
                        "\t\t|__________________________________________|\n";
            string l_24 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|                                          |\n" +
                        "\t\t|    _____          ____                   |\n" +
                        "\t\t|         \\            /          _____    |\n" +
                        "\t\t|          \\__________/          /         |\n" +
                        "\t\t|          /           \\        /          |\n" +
                        "\t\t||Школа|__/             \\______/           |\n" +
                        "\t\t|         \\                                |\n" +
                        "\t\t|          \\________                       |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|                     \\________*____       |\n" +
                        "\t\t|                                          |\n" +
                        "\t\t|__________________________________________|\n";
            string l_25 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|                                          |\n" +
                        "\t\t|    _____          ____                   |\n" +
                        "\t\t|         \\            /          _____    |\n" +
                        "\t\t|          \\__________/          /         |\n" +
                        "\t\t|          /           \\        /          |\n" +
                        "\t\t||Школа|__/             \\______/           |\n" +
                        "\t\t|         \\                                |\n" +
                        "\t\t|          \\________                       |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|                     \\_________*___       |\n" +
                        "\t\t|                                          |\n" +
                        "\t\t|__________________________________________|\n";
            string l_26 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|                                          |\n" +
                        "\t\t|    _____          ____                   |\n" +
                        "\t\t|         \\            /          _____    |\n" +
                        "\t\t|          \\__________/          /         |\n" +
                        "\t\t|          /           \\        /          |\n" +
                        "\t\t||Школа|__/             \\______/           |\n" +
                        "\t\t|         \\                                |\n" +
                        "\t\t|          \\________                       |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|                     \\__________*__       |\n" +
                        "\t\t|                                          |\n" +
                        "\t\t|__________________________________________|\n";
            string l_27 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|                                          |\n" +
                        "\t\t|    _____          ____                   |\n" +
                        "\t\t|         \\            /          _____    |\n" +
                        "\t\t|          \\__________/          /         |\n" +
                        "\t\t|          /           \\        /          |\n" +
                        "\t\t||Школа|__/             \\______/           |\n" +
                        "\t\t|         \\                                |\n" +
                        "\t\t|          \\________                       |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|                     \\___________*_       |\n" +
                        "\t\t|                                          |\n" +
                        "\t\t|__________________________________________|\n";
            string l_28 = "\n\n\t\t __________________________________________\n" +
                        "\t\t|                                          |\n" +
                        "\t\t|    _____          ____                   |\n" +
                        "\t\t|         \\            /          _____    |\n" +
                        "\t\t|          \\__________/          /         |\n" +
                        "\t\t|          /           \\        /          |\n" +
                        "\t\t||Школа|__/             \\______/           |\n" +
                        "\t\t|         \\                                |\n" +
                        "\t\t|          \\________                       |\n" +
                        "\t\t|                    \\                     |\n" +
                        "\t\t|                     \\____________*       |\n" +
                        "\t\t|                                          |\n" +
                        "\t\t|__________________________________________|\n";
            for (int i = 0; i < 1; i++)
            {
                Console.Write(l_1);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_2);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_3);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_4);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_5);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_6);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_7);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_8);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_9);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_10);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_11);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_12);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_13);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_14);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_15);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_16);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_17);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_18);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_19);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_20);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_21);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_22);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_23);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_24);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_25);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_26);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_27);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_28);
                Thread.Sleep(500);
                Console.Clear();

            }
        }
        public void Quest_1_Map_World_goRosha(int q1)
        {
            Console.Clear();
            string l_1 = "\n\n\t\t __________________________________________\n" +
                        "\t\t||выход из леса|                           |\n" +
                        "\t\t|   |                                      |\n" +
                        "\t\t|   |       __________|темная роща|        |\n" +
                        "\t\t|    \\__ __/                               |\n" +
                        "\t\t|       |                                  |\n" +
                        "\t\t||река|_|_                                 |\n" +
                        "\t\t|         \\     |болото|_____|темная роща| |\n" +
                        "\t\t|          \\              /                |\n" +
                        "\t\t|           \\____________/                 |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|             {Бауэрстоун}                 |\n" +
                        "\t\t|__________________________________________|\n";
            string l_1_2 = "\n\n\t\t __________________________________________\n" +
                        "\t\t||выход из леса|                           |\n" +
                        "\t\t|   |                                      |\n" +
                        "\t\t|   |       __________|темная роща|        |\n" +
                        "\t\t|    \\__ __/                               |\n" +
                        "\t\t|       |                                  |\n" +
                        "\t\t||река|_|_                                 |\n" +
                        "\t\t|         \\     |болото|____*|темная роща| |\n" +
                        "\t\t|          \\              /                |\n" +
                        "\t\t|           \\____________/                 |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|             {Бауэрстоун}                 |\n" +
                        "\t\t|__________________________________________|\n";
            string l_1_3 = "\n\n\t\t __________________________________________\n" +
                        "\t\t||выход из леса|                           |\n" +
                        "\t\t|   |                                      |\n" +
                        "\t\t|   |       __________|темная роща|        |\n" +
                        "\t\t|    \\__ __/                               |\n" +
                        "\t\t|       |                                  |\n" +
                        "\t\t||река|_|_                                 |\n" +
                        "\t\t|         \\     |болото|___*_|темная роща| |\n" +
                        "\t\t|          \\              /                |\n" +
                        "\t\t|           \\____________/                 |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|             {Бауэрстоун}                 |\n" +
                        "\t\t|__________________________________________|\n";
            string l_1_4 = "\n\n\t\t __________________________________________\n" +
                        "\t\t||выход из леса|                           |\n" +
                        "\t\t|   |                                      |\n" +
                        "\t\t|   |       __________|темная роща|        |\n" +
                        "\t\t|    \\__ __/                               |\n" +
                        "\t\t|       |                                  |\n" +
                        "\t\t||река|_|_                                 |\n" +
                        "\t\t|         \\     |болото|__*__|темная роща| |\n" +
                        "\t\t|          \\              /                |\n" +
                        "\t\t|           \\____________/                 |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|             {Бауэрстоун}                 |\n" +
                        "\t\t|__________________________________________|\n";
            string l_2 = "\n\n\t\t __________________________________________\n" +
                        "\t\t||выход из леса|                           |\n" +
                        "\t\t|   |                                      |\n" +
                        "\t\t|   |       __________|темная роща|        |\n" +
                        "\t\t|    \\__ __/                               |\n" +
                        "\t\t|       |                                  |\n" +
                        "\t\t||река|_|_                                 |\n" +
                        "\t\t|         \\     |болото|_____|темная роща| |\n" +
                        "\t\t|          \\              *                |\n" +
                        "\t\t|           \\____________/                 |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|             {Бауэрстоун}                 |\n" +
                        "\t\t|__________________________________________|\n";
            string l_3 = "\n\n\t\t __________________________________________\n" +
                        "\t\t||выход из леса|                           |\n" +
                        "\t\t|   |                                      |\n" +
                        "\t\t|   |       __________|темная роща|        |\n" +
                        "\t\t|    \\__ __/                               |\n" +
                        "\t\t|       |                                  |\n" +
                        "\t\t||река|_|_                                 |\n" +
                        "\t\t|         \\     |болото|_____|темная роща| |\n" +
                        "\t\t|          \\              /                |\n" +
                        "\t\t|           \\____________*                 |\n" +
                        "\t\t|                  |                       |\n" +
                        "\t\t|             {Бауэрстоун}                 |\n" +
                        "\t\t|__________________________________________|\n";
            string l_4 = "\n\n\t\t __________________________________________\n" +
                       "\t\t||выход из леса|                           |\n" +
                       "\t\t|   |                                      |\n" +
                       "\t\t|   |       __________|темная роща|        |\n" +
                       "\t\t|    \\__ __/                               |\n" +
                       "\t\t|       |                                  |\n" +
                       "\t\t||река|_|_                                 |\n" +
                       "\t\t|         \\     |болото|_____|темная роща| |\n" +
                       "\t\t|          \\              /                |\n" +
                       "\t\t|           \\___________*/                 |\n" +
                       "\t\t|                  |                       |\n" +
                       "\t\t|             {Бауэрстоун}                 |\n" +
                       "\t\t|__________________________________________|\n";
            string l_5 = "\n\n\t\t __________________________________________\n" +
                       "\t\t||выход из леса|                           |\n" +
                       "\t\t|   |                                      |\n" +
                       "\t\t|   |       __________|темная роща|        |\n" +
                       "\t\t|    \\__ __/                               |\n" +
                       "\t\t|       |                                  |\n" +
                       "\t\t||река|_|_                                 |\n" +
                       "\t\t|         \\     |болото|_____|темная роща| |\n" +
                       "\t\t|          \\              /                |\n" +
                       "\t\t|           \\__________*_/                 |\n" +
                       "\t\t|                  |                       |\n" +
                       "\t\t|             {Бауэрстоун}                 |\n" +
                       "\t\t|__________________________________________|\n";
            string l_6 = "\n\n\t\t __________________________________________\n" +
                       "\t\t||выход из леса|                           |\n" +
                       "\t\t|   |                                      |\n" +
                       "\t\t|   |       __________|темная роща|        |\n" +
                       "\t\t|    \\__ __/                               |\n" +
                       "\t\t|       |                                  |\n" +
                       "\t\t||река|_|_                                 |\n" +
                       "\t\t|         \\     |болото|_____|темная роща| |\n" +
                       "\t\t|          \\              /                |\n" +
                       "\t\t|           \\_________*__/                 |\n" +
                       "\t\t|                  |                       |\n" +
                       "\t\t|             {Бауэрстоун}                 |\n" +
                       "\t\t|__________________________________________|\n";
            string l_7 = "\n\n\t\t __________________________________________\n" +
                       "\t\t||выход из леса|                           |\n" +
                       "\t\t|   |                                      |\n" +
                       "\t\t|   |       __________|темная роща|        |\n" +
                       "\t\t|    \\__ __/                               |\n" +
                       "\t\t|       |                                  |\n" +
                       "\t\t||река|_|_                                 |\n" +
                       "\t\t|         \\     |болото|_____|темная роща| |\n" +
                       "\t\t|          \\              /                |\n" +
                       "\t\t|           \\________*___/                 |\n" +
                       "\t\t|                  |                       |\n" +
                       "\t\t|             {Бауэрстоун}                 |\n" +
                       "\t\t|__________________________________________|\n";
            string l_8 = "\n\n\t\t __________________________________________\n" +
                       "\t\t||выход из леса|                           |\n" +
                       "\t\t|   |                                      |\n" +
                       "\t\t|   |       __________|темная роща|        |\n" +
                       "\t\t|    \\__ __/                               |\n" +
                       "\t\t|       |                                  |\n" +
                       "\t\t||река|_|_                                 |\n" +
                       "\t\t|         \\     |болото|_____|темная роща| |\n" +
                       "\t\t|          \\              /                |\n" +
                       "\t\t|           \\_______*____/                 |\n" +
                       "\t\t|                  |                       |\n" +
                       "\t\t|             {Бауэрстоун}                 |\n" +
                       "\t\t|__________________________________________|\n";
            string l_9 = "\n\n\t\t __________________________________________\n" +
                      "\t\t||выход из леса|                           |\n" +
                      "\t\t|   |                                      |\n" +
                      "\t\t|   |       __________|темная роща|        |\n" +
                      "\t\t|    \\__ __/                               |\n" +
                      "\t\t|       |                                  |\n" +
                      "\t\t||река|_|_                                 |\n" +
                      "\t\t|         \\     |болото|_____|темная роща| |\n" +
                      "\t\t|          \\              /                |\n" +
                      "\t\t|           \\______*_____/                 |\n" +
                      "\t\t|                  |                       |\n" +
                      "\t\t|             {Бауэрстоун}                 |\n" +
                      "\t\t|__________________________________________|\n";
            string l_10 = "\n\n\t\t __________________________________________\n" +
                      "\t\t||выход из леса|                           |\n" +
                      "\t\t|   |                                      |\n" +
                      "\t\t|   |       __________|темная роща|        |\n" +
                      "\t\t|    \\__ __/                               |\n" +
                      "\t\t|       |                                  |\n" +
                      "\t\t||река|_|_                                 |\n" +
                      "\t\t|         \\     |болото|_____|темная роща| |\n" +
                      "\t\t|          \\              /                |\n" +
                      "\t\t|           \\____________/                 |\n" +
                      "\t\t|                  *                       |\n" +
                      "\t\t|             {Бауэрстоун}                 |\n" +
                      "\t\t|__________________________________________|\n";
            string l_11 = "\n\n\t\t __________________________________________\n" +
                      "\t\t||выход из леса|                           |\n" +
                      "\t\t|   |                                      |\n" +
                      "\t\t|   |       __________|темная роща|        |\n" +
                      "\t\t|    \\__ __/                               |\n" +
                      "\t\t|       |                                  |\n" +
                      "\t\t||река|_|_                                 |\n" +
                      "\t\t|         \\     |болото|_____|темная роща| |\n" +
                      "\t\t|          \\              /                |\n" +
                      "\t\t|           \\____________/                 |\n" +
                      "\t\t|                  |                       |\n" +
                      "\t\t|             {Бауэрстоун}                 |\n" +
                      "\t\t|__________________________________________|\n";
            if (q1 == 0)
            {
                for (int i = 0; i < 1; i++)
                {
                    Console.Write(l_11);
                    Thread.Sleep(500);
                    Console.Clear();
                    Console.Write(l_10);
                    Thread.Sleep(500);
                    Console.Clear();
                    Console.Write(l_9);
                    Thread.Sleep(500);
                    Console.Clear();
                    Console.Write(l_8);
                    Thread.Sleep(500);
                    Console.Clear();
                    Console.Write(l_7);
                    Thread.Sleep(500);
                    Console.Clear();
                    Console.Write(l_6);
                    Thread.Sleep(500);
                    Console.Clear();
                    Console.Write(l_5);
                    Thread.Sleep(500);
                    Console.Clear();
                    Console.Write(l_4);
                    Thread.Sleep(500);
                    Console.Clear();
                    Console.Write(l_3);
                    Thread.Sleep(500);
                    Console.Clear();
                    Console.Write(l_2);
                    Thread.Sleep(500);
                    Console.Clear();
                    Console.Write(l_1);
                    Thread.Sleep(500);
                    Console.Clear();
                }
            }
            if (q1 == 1)
            {
                for (int i = 0; i < 1; i++)
                {
                    Console.Write(l_1);
                    Thread.Sleep(500);
                    Console.Clear();
                    Console.Write(l_1_2);
                    Thread.Sleep(500);
                    Console.Clear();
                    Console.Write(l_1_3);
                    Thread.Sleep(500);
                    Console.Clear();
                    Console.Write(l_1_4);
                    Thread.Sleep(500);
                    Console.Clear();
                }
            }
            if (q1 == 2)
            {
                Console.Write(l_1_4);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_2);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_3);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_4);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_5);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_6);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_7);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_8);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_9);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_10);
                Thread.Sleep(500);
                Console.Clear();
                Console.Write(l_11);
                Thread.Sleep(500);
                Console.Clear();
            }

        }
    }
}
      
